[{"id":"1696aec8-2c84-11e8-9d3f-e520a3e5b241","created_at":"Tue Mar 20 21:18:19 UTC 2018","title":"Full-Stack Senior Web Developer - Remote","location":"Charlotte, NC","type":"Full Time","description":"<p>Want to have fun coding cool, challenging stuff from the comfort of your own home?</p>\n\n<p>Eager to join a team of high-performing, yet humble systems thinkers that simply get things done?</p>\n\n<p>Excited to be a part of a <strong>rapidly growing $250 billion+ industry</strong> while measurable improving people’s lives?</p>\n\n<p>If so, and you’re a kick-butt, full-stack developer with an incessant drive towards excellence an unquenchable curiosity, and a get-it-done now mentality, please read on to as we’d love to talk.</p>\n\n<p><strong>Who We Are:</strong></p>\n\n<p>We, Natural Health Sherpa, create innovative products that optimize people’s metabolism so they can enjoy more energy, feel great and enjoy life. Frustratingly, the world is setup to encourage sickness vs. health, so our products are designed to make healthy living super-easy.</p>\n\n<p>We're an 8-figure company that's been profitable since day 1 of our founding in 2010. We’re in the process of re-branding our company Metabolic Living, which more accurately reflects our full suite of products we’ve developed.</p>\n\n<p>As part of that re-branding, we’re porting our outdated website at <a href=\"http://www.naturalhealthsherpa.com\">www.naturalhealthsherpa.com</a> to our modernized content platform we’re building at <a href=\"http://www.metabolicliving.com\">www.metabolicliving.com</a> and rolling our a state-of-the-art mobile app. As part of this migration, we have a number of exciting development projects in the works, including re-architecting our e-commerce and analytics system.</p>\n\n<p>We're riding the $250+ billion annual tidal wave of demand for natural health products. And we’re positioning our new brand to be right on top of that wave. It is an extremely exciting time for us now.</p>\n\n<p>Our nutrition courses and exercise programs are designed to deliver the most results in the least time. For example, our exercise videos deliver the same or better benefits in just 15 minutes, 3 times a week than do traditional exercise programs that require 60 minutes, 5 times a week. Yes, really.</p>\n\n<p>You can see an example of one of our exercise products at <a href=\"http://www.metabolicrenewal.com\">http://www.metabolicrenewal.com</a> as our e-commerce happens on product-specific websites for now. All e-commerce will happen on <a href=\"http://www.metabolicliving.com\">http://www.metabolicliving.com</a> as part of the re-branding.</p>\n\n<p>We also formulate state-of-the-art nutritional supplements and functional foods that fuel your metabolism to generate the energy you need to consistently perform at your peak. For example, instead of taking weeks to notice a difference, it takes just days to feel better.</p>\n\n<p>We practice what we preach: our company is designed so everyone on our team both enjoys their work challenges while having plenty of time to do what they love to do the most in their life. <strong>We recruit only high-performing, humble people who produce in fast cycles,</strong> hold themselves accountable and have fun.</p>\n\n<p><strong>Who We Need:</strong></p>\n\n<p>We’re scouring the U.S. for a full-time, mega-productive full-stack web developer to join our team. It is a remote/work-at-home position with a very flexible work/vacation schedule as lifestyle is hugely important to our company given what we do.</p>\n\n<p>This opportunity is suited only for a high-performing full-stack developer with an integrative mindset and proven ability to get things done cleanly and on time. The ideal person is comfortable being hands-on in all facets of web engineering from the browser-to-the-code-to-the-server.</p>\n\n<p>You will work hand-in-hand with our existing CTO to optimize, support and manage our entire web infrastructure. The two of you will form our core development team, have the ability to cover for each other as vacation and other needs arise, but also to work synergistically on separate projects.</p>\n\n<p>Just as we obsess about creating healthy living products that get the most results in the least time, we’re looking for someone equally obsessed about doing the same thing with beautiful, efficient code.</p>\n\n<p>While your coding skills are important, it's how fast you process information, how quickly (and accurately) you can cycle through work and how well you work with the rest of our team that's crucial.</p>\n\n<p>Finally, we’re looking for someone who can collaborate in real-time with the company’s founder, who manages our marketing and advertising. This can require real-time communication throughout the day based on our heavy advertising spend (can reach $50k / day). The ability to turn a business conversation into an actionable set of dev tasks that you can jump on immediately is crucial.</p>\n\n<p><strong>What the Ideal Candidate Looks Like:</strong></p>\n\n<p>Deep experience as an end-to-end application/web architect responsible for every single part of the project including requirements gathering, project management, system architecture, infrastructure setup, coding, integrating with third parties and documenting and testing.</p>\n\n<p>10+ years’ experience as a software engineer/web developer with recent, applicable focus on database-driven web applications on a LAMP stack.</p>\n\n<p>Expert-level, working knowledge of HTML, CSS, and JavaScript; our design team creates most of the assets, but you’ll be implementing, optimizing, troubleshooting, and adding functionality.</p>\n\n<p>Ability to build complex PHP applications quickly, efficiently, and under pressure. Our application stack runs on CodeIgniter, so working knowledge of that framework is a plus.</p>\n\n<p>Just as good with SQL as you are with PHP with ability to write ad-hoc queries for data extracts by hand, optimize tables with 100s of millions of rows, and built new, smart database schemas.</p>\n\n<p>Familiarity with CDNs (especially Amazon S3 and CloudFront) and general web speed optimization design patterns and techniques.</p>\n\n<p>Solid knowledge of Linux, Apache, and general infrastructure/server support so you can troubleshoot and optimize as needed with our hosting team.</p>\n\n<p>You’re a self-starter who can take initiative and run with the ball without having to be told what to do and you love analyzing seemingly intractable problems and devising creative solutions.</p>\n\n<p>You’re a strong project manager who can scope out technical requirements based on business needs, define deliverables, create a project plan and then execute and deliver upon that plan.</p>\n\n<p>You’re available during normal ET business hours (8a-5p) with occasional off-hour support during critical business events.</p>\n\n<p><strong>What You’ll Be Doing:</strong></p>\n\n<p>Primary focus will be adding features and functionality to our direct response software platform (LAMP), integrating with 3rd party tools, optimizing our web infrastructure and creating workflow automation modules.</p>\n\n<p>Designing, maintaining and enhancing internal systems, programs and web applications, including e-commerce, marketing campaign tracking, content management and more.</p>\n\n<p>Building and improving existing and new analytics and reports using MySQL, large datasets, and a custom-build replication and data warehouse engine.</p>\n\n<p>Manage asset, code, and database deployments to managed servers and cloud servers, as well as building or finding tools to improve and automate the deployment and testing process.</p>\n\n<p>Proactively suggest ways to improve any system you work with, looking for opportunities to use technology to deliver clear, measurable value to the business.</p>\n\n<p><strong>5 Key Attributes We Look For:</strong></p>\n\n<p><strong>Quickly Engages</strong> – <em>Attacks projects immediately, doing just the right amount of planning to avoid analysis paralysis, constantly pushing and maintaining high intensity.</em> </p>\n\n<p><strong>Takes Ownership</strong> – <em>Takes personal responsibility for projects due to a deep sense of pride, going the extra mile, constantly surprising, solving problems proactively.</em> </p>\n\n<p><strong>Produces Results</strong> – <em>Prioritizes work based on what’s most impactful to company, while deftly cycling through tasks to produce the most meaningful results the fastest.</em> </p>\n\n<p><strong>Relentlessly Persists</strong> – <em>Embraces get-it-done attitude, relentlessly attacks problems at different angles until something works, staying resilient until the task is done.</em> </p>\n\n<p><strong>Collaborates Smoothly</strong> – <em>Gels well within or across teams, respecting others, communicating candidly, no hidden agendas, coordinating effectively so things get done faster.</em> </p>\n\n<p><strong>What You'll Enjoy from Us:</strong></p>\n\n<p><strong>Highly Competitive Salary</strong> – This respects the fact that you are a needle in a haystack, a true high-performer that any company would die to have on their team.</p>\n\n<p><strong>Flexible Benefits</strong> – We can customize your benefits to your specific situation, rather than forcing you to accept something that may not make sense for you.</p>\n\n<p><strong>Work-from-Home Flexibility</strong> – A fantastic lifestyle that allows you to work from home, have flexible hours when needed with ability to carve out time to do what you love.</p>\n\n<p><strong>Curated Team</strong> – Peace of mind knowing we only recruit high-performing, humble people and that you’ll be surrounded by a supportive, high-energy team that respects you and your work.</p>\n\n<p>If this sounds like a good fit, if you’re excited to do something challenging and meaningful that preserves your ability to enjoy life to the fullest, then please apply apply ASAP as we can’t wait to meet you!</p>","how_to_apply":"<p><a href=\"https://naturalhealthsherpa.workable.com/j/DCF1488C8E\">https://naturalhealthsherpa.workable.com/j/DCF1488C8E</a></p>","company":"Natural Health Sherpa","company_url":"https://www.naturalhealthsherpa.com/","company_logo":"http://github-jobs.s3.amazonaws.com/59ccadec-2c83-11e8-9153-3a05b7d670a0.jpg","url":"http://jobs.github.com/positions/1696aec8-2c84-11e8-9d3f-e520a3e5b241"},{"id":"5009b54c-2c7f-11e8-9b2c-b4f0ad8a48a0","created_at":"Tue Mar 20 20:43:15 UTC 2018","title":"Data Analyst","location":"San Diego, CA, US","type":"Full Time","description":"<p></p><p>Motive Interactive is a global mobile app optimization and marketing company that combines over 15 years of experience in the digital advertising industry and sophisticated programmatic technology to drive user acquisition for some of the world’s top mobile app companies including Amazon, Apple, and Pandora.  In 2017, Motive Interactive was recognized as a top 20 partner by Singular’s Mobile ROI index, a ranking that evaluates over 1000 mobile ad networks, 1500 apps, and over $3B in ad spend to identify the world’s best-performing ad networks across the globe. Additionally, Motive is recognized as part of Inc. 5000’s exclusive Hall of Fame list for its five-year consecutive rating as one of the fastest-growing private firms in America. To continue the build-out of our programmatic capability, we are looking for a candidate in one of the data-oriented principles to join our data team full-time.</p><p><strong>Responsibilities:</strong></p><ul>\n<li>Dive deep into our dataset and report to communicate business trends and opportunities</li> <li>Verify third party data and assemble large, complex data sets that meet business requirements</li>  <li>Expand and optimize our data and data pipeline architectures, as well as data flow and collection for cross-functional teams</li>   <li>Work with stakeholders including media buying, data scientist, and business teams to assist data related issues</li>    <li>Do ad-hoc data analysis, reporting and present results to the team</li>\n</ul><p><strong>Qualifications</strong>:</p><ul>\n<li>2+ years of related work experience in analytics</li>   <li>A solid foundation in statistics, regression, correlation, etc.</li>    <li>Strong SQL skills and experience working with relational database</li>  <li>Basic understanding of ETL mechanism</li>   <li>Knowledge of business intelligence, data visualization, and related tools</li>  <li>Highly analytical and detail oriented</li>  <li>Excellent communications</li>   <li>Master degree in Mathematics, Statistics or related technical fields</li>   <li>Nice to have:   <ul>\n<li>God scripting and programming skills. Python skill is highly preferred</li>     <li>Understanding f digital advertising</li>        <li>Experiences with setting up a data dashboard</li>   </ul>\n</li>\n</ul><p><strong>Perks</strong></p><ul>\n<li>Ranked as one of San Diego's best places to work.</li>  <li>Work in a fast-paced development environment where you will see the results of your work immediately</li>   <li>A casual relaxed atmosphere with a results-driven mentality</li>    <li>Competitive compensation</li>   <li>Health benefits: Medical/dental/vision benefits</li>    <li>401K</li>   <li>Profit from working with a team on the cutting edge of the mobile marketing and advertising industry.</li>  <li>Quickly expand your skills as a mobile marketing professional and build a valuable network in one of the fastest growing segments of marketing. </li>  <li>Awesome company events!</li>\n</ul><img src=\"https://www.applytracking.com/track.aspx/7fBut\">","how_to_apply":"<p><a href=\"https://www.applytracking.com/track.aspx/7fBvX\">https://www.applytracking.com/track.aspx/7fBvX</a></p>","company":"Motive Interactive","company_url":null,"company_logo":null,"url":"http://jobs.github.com/positions/5009b54c-2c7f-11e8-9b2c-b4f0ad8a48a0"},{"id":"b7b90be2-2c7b-11e8-8d4d-0a6cf3ebd662","created_at":"Tue Mar 20 20:18:21 UTC 2018","title":"POC Python Developer","location":"Remote","type":"Full Time","description":"<p>We are a developer-first company, creating the future of banking information exchange. As a developer with us you’ll be responsible for building our API as a product that unifies financial/utility data feeds.</p>\n\n<p>You will work on E2E encryption based on the signal protocol. You will be using engineering practices such as Test Automation, Behaviour-Driven Development (BDD), Continuous Integration (CI), Continuous Delivery (CD). Yup, we do DevOps and always start our work with BDD feature files.</p>\n\n<p>You will have the option of working remotely with flexible hours, and will participate in monthly team meetups at our London offices. A great way to put a face to the commits!</p>\n\n<p>Here are some skills that will come in handy:</p>\n\n<p>Experience writing REST wrappers for legacy projects (SOAP for example);\nGood at solving problems and knowing how to document those problems in Behave/Celery;\nHaving an understanding of why it’s irresponsible to write an API without consuming it at the same time.</p>\n\n<p>With this role we are looking strictly for people who can, from 1-2 paragraphs of text, fill in the blanks and in matter of few days deliver a technical POC. It can be dirty, it can be barely-working, but it must prove that we can deliver it, and that it will work as we need it to (also known as meeting business requirements). This will be done with very little to no supervision, but plenty of available people to talk to if you need to bounce ideas off someone!</p>\n\n<p>HOW TO APPLY</p>\n\n<p>If you cover at least some of the above points, we want to talk with you. And by talk we mean talk, we don’t use Codility or other nonsense tools. Instead our process is simple - let us know that you exist by sending a short email telling us about yourself and attach a résumé.</p>\n\n<p>Perform this short two to four hour programming task - <a href=\"https://github.com/StudioH67/service_registry\">https://github.com/StudioH67/service_registry</a> - and when you are done please open a pull request to this repo with your solution. We get back to everyone who submits a solution to the task.</p>\n\n<p>After we will get in touch, and if we still like one another - welcome onboard!</p>\n\n<p>We offer generous salary and benefits compared to industry standards, all you have to do is show us how much you are worth!</p>\n\n<p>ABOUT US</p>\n\n<p>We’re a startup. We’re funded. And we have a client. We’re a group of founders who have built companies together and are committed to building amazing teams. This is our next venture. There is an opportunity for real involvement at all levels, shaping the direction and genuinely building a rocket ship. We guarantee it won’t be boring.</p>","how_to_apply":"<p>If you cover at least some of the above points, we want to talk with you. And by talk we mean talk, we don’t use Codility or other nonsense tools. Instead our process is simple - let us know that you exist by sending a short email telling us about yourself and attach a résumé.</p>\n\n<p>Perform this short two to four hour programming task - <a href=\"https://github.com/StudioH67/service_registry\">https://github.com/StudioH67/service_registry</a> - and when you are done please open a pull request to this repo with your solution. We get back to everyone who submits a solution to the task.</p>\n\n<p>After we will get in touch, and if we still like one another - welcome onboard!</p>","company":"StudioH67","company_url":null,"company_logo":null,"url":"http://jobs.github.com/positions/b7b90be2-2c7b-11e8-8d4d-0a6cf3ebd662"},{"id":"c874a88e-2c57-11e8-9f81-fb7e0430a01d","created_at":"Tue Mar 20 16:00:17 UTC 2018","title":"Commerce Software Engineer, Apple Media Products","location":"New York","type":"Full Time","description":"<p>DESCRIPTION: Changing the world is all in a day's work at Apple. If you love innovation, here's your chance to make a career of it. You'll work hard. But the job comes with more than a few perks.</p>\n\n<p>The Apple Media Products Commerce Engineering Team is looking for a proven Software Engineer to work on App Store features, including Account Creation, Manage Payment Info, Content Purchase, In-App purchase, subscriptions and more. Join our exciting engineering team that has been leading the digital distribution industry by constantly developing innovative features since its launch. The position requires someone who's comfortable with all aspects of the software design cycle.</p>\n\n<p>Key Qualifications:  </p>\n\n<ul>\n<li>At least 5+ years of experience in designing, implementing and supporting highly scalable applications and web services in Java</li>\n<li>Experience in complex 3rd party integrations (synchronous to asynchronous design)</li>\n<li>Solid experience working with SQL and large relational databases (Oracle) including data modeling</li>\n<li>Experience building and using distributed systems, distributed caching, distributed key-value stores</li>\n<li>Experience programming for eventual consistency</li>\n<li>Experience programming with one or more scripting languages is a plus</li>\n<li>Strong communication and leadership skills; you will be required to proactively engage with other teams</li>\n</ul><p>Description:\nThe position covers engineering solutions related to all forms of In-App purchases and services supporting In-App purchases.</p>\n\n<p>You will also be responsible for account management features such as authentication, account creation, editing of billing information, security features supporting account changes and managing different aspects of accounts like season passes, pre-orders and more.</p>\n\n<p>You will lead a team and work cross-functionally with business development, financial and reporting teams, design, UI, operations, production support, multiple device/client teams and various external partners worldwide. You will be challenged to manage, evolve, and invent new features in the ever changing, nimble e-commerce space. Therefore, you must master new technology quickly, be comfortable working in a fast-paced environment, have a “can-do” attitude, work well in a cross-functional environment, adapt and collaborate well, and lead from the trenches. Join us in this exciting chapter for the growth of the new commerce platform!</p>\n\n<p>Education:\nBS in Computer Science or equivalent. MS preferred.\nW\nApple is an Equal Employment Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities.</p>\n\n<p>REQUISITION NUMBER: 113401948\nCOMPANY NAME: Apple Inc.</p>","how_to_apply":"<p><a href=\"https://ars2.equest.com/?response_id=4f2fb739f98a8c1f55114d1d89a091f4\">APPLY HERE</a></p>","company":"Apple Inc.","company_url":"http://www.apple.com","company_logo":"http://github-jobs.s3.amazonaws.com/c5bc8c38-2c57-11e8-9e97-cf53a2efa65e.jpeg","url":"http://jobs.github.com/positions/c874a88e-2c57-11e8-9f81-fb7e0430a01d"},{"id":"201a06a2-2b7b-11e8-96c6-54253a09b0ba","created_at":"Mon Mar 19 13:41:10 UTC 2018","title":"Lead frontend developer","location":"Amsterdam","type":"Full Time","description":"<p><strong>Lead frontend developer</strong><br><em>Amsterdam</em><br><br><strong>TL;DR</strong><br>\nAls ervaren frontend developer ben je wel toe aan een nieuwe uitdaging. Je vindt het leuk om andere ontwikkelaars aan te sturen en te begeleiden, zodat zij beter worden in hun vak. Maar je zit ook graag bij klanten aan tafel. Je helpt ze om de juiste beslissingen te nemen, waarbij je techniek en business met elkaar in balans brengt. Of de voertaal nou Nederlands of Engels is, maakt niet uit: in beide talen voel je je prima op je gemak.<br><br><strong>Hoe ziet een dag eruit</strong><br>\nErgens in de ochtend. Je komt binnen in ons kersvers gerestylede kantoor in Amsterdam, high-fivet je collega’s en pakt snel een kop koffie, want in de meetingroom zit al een sollicitant klaar. Het is een enthousiaste medior frontend developer, die heeft gereageerd op de recruitmentcampagne die je samen met een bureau hebt opgezet.<br><br>\nHet gesprek gaat fantastisch: al vanaf de eerste minuut weet je zeker dat je tegenover een rasechte Incentronaut zit. Hij is open, ondernemend, technisch goed onderlegd en blijkt ook nog eens uitstekend te kunnen windsurfen. Niet dat surfskills een vereiste zijn, maar het is altijd leuk als collega’s een passie naast hun werk hebben. Je besluit om de kandidaat op staande voet aan te nemen, overlegt nog even met een collega en print dan meteen een contract uit. Handtekening erop en klaar!<br><br>\nAls dat geregeld is, loop je even naar de junior frontend developer die net uit de Young Professional Academy is gerold. Ze is bezig met een formulier dat al een tijdje op de backlog van een klant staat en vraagt zich af hoe ze ervoor kan zorgen dat de gebruiker de pagina kan vernieuwen zonder dat de ingevulde data verloren gaat. Je geeft net genoeg hints zodat ze zelf verder kan.<br><br>\nDan schuif je aan bij je collega met wie je samen een pre-salestraject doet. De uitdaging: een internationale klant wil zijn mijn-omgeving compleet migreren en restylen. Met als extra moeilijkheid dat de helft van de eindgebruikers in landen woont waar het internet nog geen topsnelheid bereikt. Je klant denkt aan een oplossing met Angular, maar jij weet zeker: deze klus schreeuwt om React. Samen met je collega bedenk je hoe je de klant van jouw advies gaat overtuigen.<br><br>\nDan is het lunchtijd, het hele kantoor neemt plaats aan de eettafel. Jij eet ook mee, maar wel een beetje snel omdat je straks naar een klant moet. Daar werkt een team van Incentro-frontenders en designers al twee maanden keihard aan een nieuwe website en jij wilt de refinement meemaken. Bovendien wil je de middag besteden aan het opzetten van Redux, waar je gisteren niet aan toe bent gekomen. Dus je houdt het bij een boterham en springt in de auto.<br><br>\nEenmaal bij de klant maak je eerst een praatje met je teamleden. Je wilt graag weten wat de status van hun werkzaamheden is en of ze je hulp ergens bij nodig hebben. Daarna sluit je aan bij de refinement. De klant heeft nieuwe user stories toegevoegd en jouw technische kennis is hard nodig om ze ‘ready’ te krijgen voor het team. Je spart met de designers, backenders en product owner en geeft aan waar nog informatie ontbreekt.<br><br>\nNa de refinement review je nog een pull-request op Github en schrijf je een stuk javascript voor een story die in de huidige sprint zit. Je wilt graag een voorzet doen zodat je teamlid geïnspireerd raakt en daarmee verder kan. De dag zit er alweer op. Morgen weer een nieuwe!<br><br><strong>Dit kun je</strong><br>\nJe bent<strong> meer dan 3 jaar</strong> aan het <strong>coden </strong>en hebt ervaring met:</p>\n\n<ul>\n<li>\n<strong>agile software development</strong>;</li>\n    <li>Continuous Integration en Continuous Delivery (Docker, Jenkins);</li>\n    <li>andere disciplines binnen het domein, zoals analytics, A/B-testing en performance;</li>\n    <li>samenwerking met UX-teams.</li>\n</ul><p><br>\nEn als wij deze termen noemen, weet jij precies wat we bedoelen:</p>\n\n<ul>\n<li>\n<strong>HTML</strong>, <strong>CSS </strong>en <strong>Javascript</strong>.</li>\n    <li>\n<strong>Node.js</strong> en <strong>REST-services</strong>.</li>\n    <li>Javascript-frameworks zoals <strong>Angular</strong>, <strong>React </strong>en <strong>Vue</strong>.</li>\n    <li>\n<strong>CSS preprocessors</strong> (SCSS) en <strong>CSS</strong>-<strong>architectuur </strong>(SMACSS, BEM).</li>\n    <li>\n<strong>GIT</strong>, <strong>NPM</strong>, <strong>Webpack</strong>, <strong>Gulp</strong>.</li>\n    <li>Responsive Design en Mobile First;</li>\n    <li>Unit en end2end-testing (bijvoorbeeld Mocha, Chai, Jasmine, Karma).</li>\n</ul><p><br><strong>Werken bij Incentro</strong><br>\nIncentro is niet zomaar een IT-bedrijf. We hebben alle expertises in huis om klanten fantastische totaaloplossingen te bieden: van developers tot data-analisten, van DevOps-experts tot designers en van agile-coaches tot online marketeers. Wil je tijdens een project dus even sparren met een UX-specialist, dan is dat zo geregeld. Daarnaast is Incentro al een paar keer uitgeroepen tot beste werkgever van Nederland. Ons geheim? We kennen geen kpi’s, maar focussen op geluk. Want wie lol heeft in zijn werk, is per definitie succesvol. Daar zijn we van overtuigd.<br><br><strong>Om je geluk nog groter te maken, bieden we:</strong></p>\n\n<ul>\n<li>persoonlijke ontwikkelingsmogelijkheden tijdens je hele carrière bij Incentro;</li>\n    <li>een uitstekend salaris en fijne arbeidsvoorwaarden, zoals:\n    <ul>\n<li>een vast contract;</li>\n        <li>leaseauto;</li>\n        <li>NS-Businesscard;</li>\n        <li>pick-your-own laptop;</li>\n        <li>een bijdrage aan je pensioenpremie;</li>\n        <li>winstdeling;</li>\n    </ul>\n</li>\n    <li>de mogelijkheid om aandelen in Incentro te kopen, en dus om mede-eigenaar te worden;</li>\n    <li>klussen bij uitdagende opdrachtgevers als Telfort, Yarden, Univé, PostNL, KPN en Randstad;</li>\n    <li>enorm veel ruimte voor creativiteit;</li>\n    <li>prachtige werklocaties, zoals de Mediahaven aan het Amsterdamse IJ en de Van Nelle Fabriek in Rotterdam;</li>\n    <li>legendarische borrels, sportuitjes, teambuildings en een wintersportuitje waar nog jaren over wordt nagepraat.</li>\n</ul><p><br><strong>Overtuigd?</strong><br>\nBen je enthousiast geworden van deze vacature, solliciteer dan via het <a href=\"https://ltpx.nl/CNVCuky\" target=\"_blank\"><strong>online sollicitatieformulier</strong></a>. Wanneer je je gegevens hebt achtergelaten, nemen wij contact met je op.<br><br>\nHeb je vragen over de functie, of gewoon zin om eens te bellen? Dan kun je terecht bij Jan Hendriks: <a href=\"mailto:jan.hendriks@incentro.com\"><strong><a href=\"mailto:jan.hendriks@incentro.com\">jan.hendriks@incentro.com</a></strong></a> of +31(0) 6 19 356 443. Of kijk op <a href=\"https://ltpx.nl/HoKn0em\" target=\"_blank\"><strong>incentro.com</strong></a> voor meer informatie over onze organisatie.<br><br>\nWe horen graag van je!<br><br><em>Acquisitie naar aanleiding van deze vacature wordt niet op prijs gesteld.</em><img alt=\"\" src=\"https://bcontrol.brockmeyer.nl/track.php?orderid=41801\"></p>","how_to_apply":"<p><a href=\"https://ltpx.nl/UU4ZogI\" target=\"_self\">Klik hier om te solliciteren</a></p>","company":"Incentro","company_url":"https://www.incentro.com","company_logo":"http://github-jobs.s3.amazonaws.com/18bb53ac-2b7b-11e8-94ca-480294fa7078.jpg","url":"http://jobs.github.com/positions/201a06a2-2b7b-11e8-96c6-54253a09b0ba"},{"id":"d21df5f8-2b7a-11e8-929e-f3c1059d0c40","created_at":"Mon Mar 19 13:39:05 UTC 2018","title":"Magento Developer","location":"Oakland","type":"Full Time","description":"<p><strong>Magento Developer</strong><br><br><strong>About ReadyTech</strong><br>\nReadyTech Corporation (<strong><a href=\"https://ltpx.nl/kYvAFZ4\" target=\"_blank\">readytech.com</a></strong>) is an Oakland-based software and service company in business since 1992. Our software is used by companies to deliver training classes and sales demos around the world.<br><br><strong>Position Description</strong><br>\nWe are looking for a experienced PHP / Magento Developer with 2-5 years of development experience. This position will be a critical member of a small engineering team building a top tier solution. In this position, you will be expected to build and support our Magento code base and develop innovative solutions for our e-commerce website following regulatory and industry \"best practices,\" including PCI compliance.<br><br><strong>Primary Responsibilities:</strong></p>\n\n<ul>\n<li>Participate in all phases of development from definition and design through implementation, debugging, testing and deployment to ensure all work is to the highest standards</li>\n    <li>Collaborate with a team of developers (including remote teams), test engineers, support and product stakeholders</li>\n    <li>Develop and implement innovative and secure features and functionality for e-commerce</li>\n    <li>Take ownership for design, development and maintenance</li>\n    <li>Participate in code reviews and technical quality standards within the project team</li>\n    <li>Write unit tests to ensure a high quality deliverable into QA</li>\n</ul><p><br><strong>Skills and Experience:</strong></p>\n\n<ul>\n<li>3-5 years' experience in objet oriented PHP programming with 2+ years developing real-world e-commerce website on Magento platform including developing plugins</li>\n    <li>Magento 2.x experience a must</li>\n    <li>Strong understanding of MVC design patterns</li>\n    <li>Broad understanding of all the components of customer facing web applications</li>\n    <li>Experience with multi-tenancy</li>\n    <li>Experience developing dynamic, data-driven sites</li>\n    <li>Candidate must have excellent understanding of browser capabilities and issues</li>\n    <li>Proficient in HTML, XHTML, HTML5, CSS, JQuery, Javascript and Ajax</li>\n    <li>Experience integrating 3rd party payment systems and knowledge of PCI/PA-DSS compliance</li>\n    <li>Experience in API integration using WebServices (SOAP, REST, JSON)</li>\n    <li>Deep understanding of current and emerging trends in E-Commerce</li>\n    <li>Experience in GIT, JIRA and UNIX environments</li>\n    <li>Keen eye for UI design a plus</li>\n    <li>Agile experience a plus</li>\n    <li>Magento Certification a plus</li>\n    <li>BS in CS or equivalent experience</li>\n</ul><p><br><strong>What We Offer:</strong></p>\n\n<ul>\n<li>Competitive Salary</li>\n    <li>Full benefits package – medical, dental, vision, 401k w/match, profit sharing, PTO and more</li>\n    <li>Great coworkers and a friendly work environment</li>\n    <li>Vibrant location in downtown Oakland, close to 19th Street BART, restaurants and entertainment</li>\n    <li>Opportunity to make a big difference in a small company atmosphere</li>\n</ul><p><br><strong>Are you up for the challenge?</strong><br>\nApply now via the<strong> <a href=\"https://ltpx.nl/sLaAh2M\" target=\"_blank\">application form</a></strong>. <br><br><em>Are you representing an agency? Thank you for your interest in our job offer but we do not need external help to fill our roles.</em><img alt=\"\" src=\"https://bcontrol.brockmeyer.nl/track.php?orderid=42865\"></p>","how_to_apply":"<p><a href=\"https://ltpx.nl/CMLgcw6\" target=\"_self\">Apply here</a></p>","company":"ReadyTech","company_url":"https://www.readytech.com/","company_logo":"http://github-jobs.s3.amazonaws.com/ca623b1c-2b7a-11e8-9cd5-640e985ccac9.jpg","url":"http://jobs.github.com/positions/d21df5f8-2b7a-11e8-929e-f3c1059d0c40"},{"id":"f291ed4c-2870-11e8-9dfa-f6095897a4de","created_at":"Fri Mar 16 17:21:45 UTC 2018","title":"Senior Engineer","location":"Portland","type":"Full Time","description":"<p>Phylos Bioscience creates groundbreaking science for the cannabis industry. Growers across the world use our genomic tools to bring high quality products to market and provide safer, more reliable experiences for consumers. We are highly motivated to achieve enduring success with ethical and community-minded values at our core. We are in a post-funding, rapid growth phase, making this an amazing time to join our innovative team.</p>\n\n<p><strong>Summary:</strong></p>\n\n<p>Our team is tasked with designing, building, and managing Phylos’ technology stack. This position is focused on creating and improving Phylos’ web experience and applications. Our public facing web presence is a mix of technologies, with many greenfield possibilities and opportunities for creative data visualization. While your skills with HTML, CSS, and Javascript are top-notch, we are excited about your love of crafting beautiful web content, your proven experience building rich client-side experiences, and your fluency in web architecture and standards. We look forward to learning together, sharing knowledge and opinions on current technology and best practices.</p>\n\n<p><strong>Responsibilities:</strong></p>\n\n<ul>\n<li>Own and manage Phylos’ responsive web presence</li>\n<li>Respond to workflows, tasks, bugs and features in support of overall project and product requirements </li>\n<li>Collaborate with marketing/product on requirements and campaigns</li>\n<li>Able to work proactively with various teams, from marketing to customer support, to gather and refine requirements</li>\n<li>Estimate, define, and communicate implementation schedules</li>\n<li>Collaborate with web designers to match visual design</li>\n<li>Deliver an excellent experience with clean and idiomatic markup, style, and code</li>\n</ul><p><strong>Skills:</strong></p>\n\n<p>We are flexible, but would like to see: </p>\n\n<ul>\n<li>Mastery of HTML, CSS, and Javascript </li>\n<li>Experience with at least one of the following Javascript libraries/frameworks: Node, React, Vue, - Webpack</li>\n<li>Experience with at least one of the following CSS tools: Sass, Less, PostCSS</li>\n</ul><p>While not required, we would be impressed by experience with any of the following:</p>\n\n<ul>\n<li>Server frameworks: Laravel, Phoenix, Rails, Django</li>\n<li>Client rendering: three.js, WebGL, or d3</li>\n<li>Ops/deploy tools: docker, nginx, AWS</li>\n</ul><p><strong>Qualifications:</strong></p>\n\n<ul>\n<li>Bachelor degree or equivalent experience</li>\n<li>Proven working experience in web programming</li>\n<li>Ability to perform a take-home code challenge as part of the interview process</li>\n<li>Ability to sit or stand at a desk in an office setting for an entire work day</li>\n<li>Legally permitted to work in the United States </li>\n<li>Acceptable results on a background check</li>\n</ul>","how_to_apply":"<p><a href=\"https://phylosbioscience.bamboohr.com/jobs/view.php?id=34\">https://phylosbioscience.bamboohr.com/jobs/view.php?id=34</a></p>","company":"Phylos Bioscience","company_url":"http://Phylosbioscience.com","company_logo":"http://github-jobs.s3.amazonaws.com/ee7444da-2870-11e8-972b-be2ccb83044e.png","url":"http://jobs.github.com/positions/f291ed4c-2870-11e8-9dfa-f6095897a4de"},{"id":"2d38955a-2933-11e8-8c8d-3a61e9e8902a","created_at":"Fri Mar 16 16:00:41 UTC 2018","title":"Commerce Data Scientist - Apple Media Products","location":"Cupertino, CA","type":"Full Time","description":"<p>DESCRIPTION: Changing the world is all in a day's work at Apple. If you love innovation, here's your chance to make a career of it. You'll work hard. But the job comes with more than a few perks.</p>\n\n<p>The Apple Media Products Commerce Engineering team has a proud tradition of delivering state of the art products in a competitive marketplace. We seek to maintain a challenging and rewarding environment where the best engineers and scientists can collaborate and produce real-world improvements in customers' online experience. You will solve problems unrivaled in scale and concept in the pursuit of new and creative features.</p>\n\n<p>We seeking a talented, experienced Applied Researcher/Data Scientist to work on high visibility projects that affect millions of customers globally. At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. If you are a self-motivated, high-energy individual who is not afraid of challenges, we're looking for you.</p>\n\n<p>Key Qualifications:  </p>\n\n<ul>\n<li>Strong Machine Learning and Data Mining background.</li>\n<li>Experience processing large-scale data prototyping, then production-level algorithms.</li>\n<li>Ability to work with incomplete or imperfect data to extract usable information.</li>\n<li>Ability to build and interpret machine learning models of complex, high-dimensional systems.</li>\n<li>Attention to detail, data accuracy and quality of output.</li>\n<li>Experience of high-level programming language for analysis (e.g. Spark, Scala, Python, R, Java)</li>\n<li>Experience with large scale distributed data processing frameworks like Hadoop and Spark</li>\n<li>Highly self-motivated, results driven and data driven. Ability to work in a fast-paced dynamic environment.</li>\n<li>Experience in payment science is a plus.</li>\n</ul><p>Description:<br>\nThe Apple Media Products Commerce Engineering team is looking for someone with a love for data. This position involves working on very large scale data mining, cleaning, analysis, deep level processing, machine learning or statistic modeling, metrics tracking and evaluation. The goal is to improve Apps Store/iTunes Store payment experience and engagement. You should have a passion for quality and an ability to understand complex systems while being able to iterate quickly on all stages of data understanding and modeling to solve the real-world problems.</p>\n\n<p>Education:<br>\nMS in Computer Science, Mathematics or other quantitative disciplines, or equivalent work experience applying machine learning, data mining techniques to real production problems.</p>\n\n<p>Ph.D. in Data Mining, Machine Learning, Statistics, Operations Research or related field preferred</p>\n\n<p>Additional Requirements:<br>\nConceive and design end to end data mining solutions to support Apple's business units and initiatives.<br>\nWork with business owners to map business requirements into technical solutions.<br>\nDevelop and implement data mining solutions to fit business problem, which may include applying algorithms from a standard tool or custom algorithm development.<br>\nSupport production data mining solutions.<br>\nPerform ad hoc statistical and data mining analyses.<br>\nPresent results of analyses to business units.  </p>\n\n<p>Apple is an Equal Employment Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities.</p>\n\n<p>REQUISITION NUMBER: 113547987\nCOMPANY NAME: Apple Inc.</p>","how_to_apply":"<p><a href=\"https://ars2.equest.com/?response_id=b1f1d5e41aa82a1bfb6bdd8af178732c\">APPLY HERE</a></p>","company":"Apple Inc.","company_url":"http://www.apple.com","company_logo":"http://github-jobs.s3.amazonaws.com/0bf34dae-2933-11e8-8ea3-77e32a12c527.jpeg","url":"http://jobs.github.com/positions/2d38955a-2933-11e8-8c8d-3a61e9e8902a"},{"id":"07ca3094-2933-11e8-93ed-0131013fd8fb","created_at":"Fri Mar 16 15:59:38 UTC 2018","title":"Applied Research Engineer, Web Discovery (ML algorithms, web crawling, search)","location":"Cupertino, CA","type":"Full Time","description":"<p>DESCRIPTION: Changing the world is all in a day's work at Apple. If you love innovation, here's your chance to make a career of it. You'll work hard. But the job comes with more than a few perks.</p>\n\n<p>The Apple Media Products Web Discovery team is looking for a world-class applied researcher to build and enhance features improving discoverability of the content in iTunes Store, App Store, Music, Movies, Podcasts, and iBooks. The team is responsible for making meaningful Apple Media content discoverable on web, social platforms, and messaging platforms.</p>\n\n<p>Key Qualifications:  </p>\n\n<ul>\n<li>Deep understanding of machine learning algorithms . </li>\n<li>Proficiency in Java or another OO language . </li>\n<li>Strong data structures, algorithms, and OO software design and implementation skills . </li>\n<li>Experience working with parallel processing technologies such as MapReduce and Hadoop . </li>\n<li>Deep understanding of web search crawling, indexing and ranking is required . </li>\n<li>Strong written and oral communication skills . </li>\n<li>Know your way around a Unix command line environment . </li>\n</ul><p>Description:<br>\nThis position is for an Applied Research Engineer within the Web Discovery team. You will use machine learning algorithms and big data technology to baseline and prioritize content discovery features. You will improve upon the massively scalable infrastructure supporting content discovery and content prioritization. You will work in collaboration with other world-class engineers, researchers, and statisticians to ensure continuous improvement in discoverability of Apple Media Products.</p>\n\n<p>Education:<br>\nBS in Computer Science or related discipline or equivalent experience, MS or PhD preferred.</p>\n\n<p>Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.</p>\n\n<p>REQUISITION NUMBER: 113485842\nCOMPANY NAME: Apple Inc.</p>","how_to_apply":"<p><a href=\"https://ars2.equest.com/?response_id=5df1222c3c26b4bd46b8b6202e2b5ff1\">APPLY HERE</a></p>","company":"Apple Inc.","company_url":"http://www.apple.com","company_logo":"http://github-jobs.s3.amazonaws.com/f9d7c190-2932-11e8-9b7e-3bc9f30b9037.jpeg","url":"http://jobs.github.com/positions/07ca3094-2933-11e8-93ed-0131013fd8fb"},{"id":"b9a0b29a-1117-11e8-9360-64724fb3d916","created_at":"Fri Mar 16 15:25:43 UTC 2018","title":"Software Engineer","location":"Stanford, CA","type":"Full Time","description":"<p>Description</p>\n\n<p>We are looking for a full stack software engineer to join the Learning Systems and Services team in the Office of Vice Provost for Teaching and Learning at Stanford. Stanford has many of the best and the biggest online courses on the web.  This team builds and operates the open-source platform behind many of them.  Students on-campus and worldwide learn via our course materials and the online communities they create.</p>\n\n<p>Technology is disrupting higher education. We believe universities can benefit from this if it's done right. Supporting research is core to what we do. We also believe that universities should be in control of how this space evolves, and that working with an open-source platform is the best way to do that.</p>\n\n<p>As a member of our full-stack engineering team, you’ll configure and deploy Open edX-based learning systems, work with the project team to build new features that meet the needs of our customers, and contribute feature back to the open source community. We accomplish that with a lightweight, mostly-Agile development process: quick daily standups, group planning, and stakeholder demos. We work on the Stanford Campus.</p>\n\n<p>CORE DUTIES:</p>\n\n<ul>\n<li>Design, develop and test new features for Open edX platform,  configure, customize, and deploy to staging and production servers, and help troubleshoot when CourseOps report production issues.</li>\n<li>Work closely with CourseOps, User Experience team, and Instructional Designers to understand requirements and specifications for new feature requests, communicate platform updates to support team/IDs, and seek feedback.</li>\n<li>Document code clearly and thoroughly, so others can maintain and support the code. Document new configuration or processes, and keep all documentation up to date.</li>\n<li>Serve as a technical resource for applications.</li>\n<li>Follow team software development methodology.</li>\n<li>Mentor RAs and Curis Summer Interns as needed. </li>\n</ul><p>ADDITIONAL INFORMATION:</p>\n\n<p>For more information check these links out:</p>\n\n<ul>\n<li>Take a class (our production site): <a href=\"https://lagunita.stanford.edu/\">https://lagunita.stanford.edu/</a>\n</li>\n<li>Learn more about Stanford's approach at Stanford Online: <a href=\"https://online.stanford.edu/\">https://online.stanford.edu/</a>\n</li>\n<li>Learn more about Open edX: <a href=\"https://open.edx.org/\">https://open.edx.org/</a>\n</li>\n<li>See our code: <a href=\"https://github.com/Stanford-Online\">https://github.com/Stanford-Online</a> and <a href=\"http://github.com/edx\">http://github.com/edx</a>\n</li>\n</ul><p>Qualifications</p>\n\n<p>PREFERRED QUALIFICATIONS:</p>\n\n<ul>\n<li>At least three years development experience (or equivalent) using modern web technologies.  Shipped production-quality code.</li>\n<li>Proficient in Python or other OO programming languages.</li>\n<li>Comfortable with full-stack development, ranging from HTML, CSS/SASS, Javascript/jQuery, to Django, MySQL, etc.</li>\n<li>DevOps experience working with AWS, using automation tools such as Ansible, Jenkins.</li>\n<li>Experience with relational and NoSQL database systems.  Able to efficiently get data into and out of a store using the right tool.</li>\n<li>Knowledge of systems and networking.  For example, you should be comfortable identifying the bottleneck resource on a busy system or debugging a distributed systems issue.</li>\n<li>Self-motivated. You work well when empowered to make decisions about what needs to be done, and when and how to do it.</li>\n<li>You're a hacker. You value shipping real software to solve real problems. You know that done is better than perfect. You aren't afraid of someone else's code.  You're a tenacious debugger.</li>\n<li>Assisting other developers by doing good code and design reviews.<br>\n</li>\n<li>Comfortable with DVCS using git and Github.  You know your way around \"git rebase -i\".</li>\n<li>You've got a good sense for how to figure out what's hard and easy, and can communicate that to others.</li>\n<li>Bonus: Open Source development experience - extra points for sharing your GitHub/Bitbucket etc. </li>\n</ul><p>MINIMUM REQUIREMENTS:</p>\n\n<p>Education &amp; Experience:\nBachelor's degree and five years of relevant experience, or a combination of education and relevant experience.</p>\n\n<p>Knowledge, Skills and Abilities:</p>\n\n<ul>\n<li>Expertise in designing, developing, testing, and deploying applications.</li>\n<li>Proficiency with application design and data modeling.</li>\n<li>Ability to define and solve logical problems for highly technical applications.</li>\n<li>Strong communication skills with both technical and non-technical clients.</li>\n<li>Ability to lead activities on structured team development projects.</li>\n<li>Ability to select, adapt, and effectively use a variety of programming methods.</li>\n<li>Knowledge of application domain.</li>\n</ul><p>Certifications and Licenses:</p>\n\n<p>None</p>\n\n<p>PHYSICAL REQUIREMENTS*:</p>\n\n<ul>\n<li>Constantly perform desk-based computer tasks.</li>\n<li>Frequently sit, grasp lightly/fine manipulation.</li>\n<li>Occasionally stand/walk, writing by hand.</li>\n<li><p>Rarely use a telephone, lift/carry/push/pull objects that weigh up to 10 pounds.</p></li>\n<li><ul>\n<li>Consistent with its obligations under the law, the University will provide reasonable accommodation to any employee with a disability who requires accommodation to perform the essential functions of the job.</li>\n</ul></li>\n</ul><p>WORKING CONDITIONS:</p>\n\n<pre><code>May work extended hours, evening and weekends.\n</code></pre>\n\n<p>WORK STANDARDS:</p>\n\n<ul>\n<li>Interpersonal Skills: Demonstrates the ability to work well with Stanford colleagues and clients and with external organizations.</li>\n<li>Promote Culture of Safety: Demonstrates commitment to personal responsibility and value for safety; communicates safety concerns; uses and promotes safe behaviors based on training and lessons learned.</li>\n<li>Subject to and expected to comply with all applicable University policies and procedures, including but not limited to the personnel policies and other policies found in the University's Administrative Guide, <a href=\"http://adminguide.stanford.edu\">http://adminguide.stanford.edu</a>.</li>\n</ul><p>Stanford is an equal opportunity employer and all qualified applicants will receive consideration without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or any other characteristic protected by law.</p>\n\n<p>Job: Information Technology Services\nLocation: Vice Provost for Teaching and Learning\nSchedule: Full-time\nGrade: J\nJob Code: 4822</p>","how_to_apply":"<p>Apply through link: <a href=\"https://stanford.taleo.net/careersection/jobdetail.ftl?job=77107&amp;lang=en\">https://stanford.taleo.net/careersection/jobdetail.ftl?job=77107&amp;lang=en</a></p>","company":"Stanford University","company_url":"https://vptl.stanford.edu/","company_logo":"http://github-jobs.s3.amazonaws.com/5431b062-1117-11e8-875d-0e51d910f4f5.jpg","url":"http://jobs.github.com/positions/b9a0b29a-1117-11e8-9360-64724fb3d916"},{"id":"d83e4790-28ae-11e8-9890-36dc0f5977ad","created_at":"Fri Mar 16 00:14:13 UTC 2018","title":"Full Stack Software Engineer","location":"Palo Alto, CA","type":"Full Time","description":"<p>Walker &amp; Company Brands is reinventing the way consumers of color learn about, purchase and enjoy health and beauty products. We’re starting with a focus on the $50 billion personal care segment. Personal care manufacturers and traditional retailers are neither building brands nor merchandising experiences which cater to the uniquely differentiated needs of black, latino and asian consumers --- three of America’s fastest growing and most culturally influential demographic groups.</p>\n\n<p>Our aim is to build the world's most consumer centric health &amp; beauty products and services company.</p>\n\n<p>Key Responsibilities:</p>\n\n<ul>\n<li>Execute on all aspects of software development phases — design, implementation, automated\n    testing, deployment and maintenance.</li>\n<li>You are in it for the long haul and excited by a fast paced startup environment and the dynamic \n    environment and flexibility that it requires.</li>\n<li>Write readable and tested code that’s easy to maintain in the long run.</li>\n<li>Act the technical subject matter expert: demonstrate technical expertise and lead projects solving \n    challenging programming and design problems.</li>\n<li>Exemplifies a “can do” attitude and strong ability to be a team player.</li>\n</ul><p>Qualifications:</p>\n\n<ul>\n<li>Ruby on Rails experience</li>\n<li>HTML5/CSS3 &amp; CSS frameworks such as Twitter Bootstrap, Zurb Foundation, etc.</li>\n<li>Experience writing vanilla javascript</li>\n<li>Experience with version control using Git, SVN, etc.</li>\n<li>Experience with Agile methodologies such as SCRUM, TDD &amp; BDD principles, continuous integration &amp; deployment</li>\n<li>Experience using cloud technologies such as AWS or GCS</li>\n<li>Strong knowledge of relational data models</li>\n<li>Previous experience and/or desire to work on challenges facing an ecommerce business.</li>\n</ul><p>Within the first month, we expect the Software Engineer to:</p>\n\n<ul>\n<li>Develop, modify and maintain Walker &amp; Company’s ecommerce platform, focusing on user \n    experience. Two brands are getbevel.com and formbeauty.com.</li>\n<li>Build out backend systems that integrate with payment provides and our fulfillment partners' \n    systems.</li>\n<li>Work with the product and design team to create functionality to add delight to customers \n    experience with Bevel.</li>\n<li>Work with customer support team to build tools to help maximize customer satisfaction.</li>\n</ul><p>Nice to have:</p>\n\n<ul>\n<li>Spree</li>\n<li>Previous startup experience</li>\n<li>Substantial open source contributions</li>\n<li>Experience mentoring fellow engineers</li>\n</ul><p>We have the support and financial backing of top-tier Silicon Valley venture capital firms and angel investors and our team has great experience building and growing many beloved consumer technology brands. We are looking for the most talented individuals across marketing, engineering, product and design functions to join our family and accelerate our growth while helping us build a great company.</p>\n\n<p>Why work at Walker &amp; Company Brands?</p>\n\n<ul>\n<li>It's an opportunity to join a small, agile company chasing a large, underserved market opportunity.</li>\n<li>Great exposure to building vertically-integrated e-commerce brands.</li>\n<li>Our office is conveniently located in downtown Palo Alto, just a 3 minute walk to and from the \n    Caltrain station. Great coffee shops and restaurants surround the office.</li>\n<li>More benefits!  Amazing health and dental plans for individuals and dependents (we pay 100% of \n    the premium costs), commuter plans, competitive equity packages, unlimited vacation and \n    personal days as needed.</li>\n<li>We dream big.  We love to compete. We like to have fun. Feel free to reference check us on that.</li>\n</ul><p>Walker &amp; Company provides equal employment and affirmative action opportunities to applicants and employees without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability. Walker &amp; Company is a federal contractor or subcontractor subject to certain governmental recordkeeping and reporting requirements for the administration of civil right laws and regulations. Employment decisions are made on the basis of job-related criteria without regard to race, ethnicity, color, religion, sex, sexual orientation, gender identity, marital status, age, genetic information, national origin, disability, military, or veteran status, or any other classification protected by applicable law.</p>\n\n<p>Visit us at: <a href=\"https://walkerandcompany.com\">https://walkerandcompany.com</a></p>","how_to_apply":"<p><a href=\"https://jobs.lever.co/walkerandcompany\">https://jobs.lever.co/walkerandcompany</a></p>","company":"Walker & Company Brands, Inc.","company_url":null,"company_logo":"http://github-jobs.s3.amazonaws.com/059282ba-28af-11e8-8c9d-b618da6bd407.png","url":"http://jobs.github.com/positions/d83e4790-28ae-11e8-9890-36dc0f5977ad"},{"id":"c99f83ae-2898-11e8-851f-a0e126e705b5","created_at":"Thu Mar 15 21:35:31 UTC 2018","title":"Senior Product Manager","location":"Nuremberg, Germany","type":"Full Time","description":"<p>Apply Now\nJob ID 309879\nDate posted 11/10/2017\nLocation: Walldorf, Baden-W¸rttemberg\nSenior Product Manager</p>\n\n<p>Other sites or home office may be an option</p>\n\n<p>With a remarkable open source heritage and a reputation for engineering excellence, SUSE is helping customers deploy the next generation of solutions for business critical infrastructure.  We are looking for an outstanding entrepreneurial character to help innovate, drive and execute product initiatives across the company. You will lead a cross-functional team, which includes highly experienced engineers and marketers, to successfully design, build and launch new releases of the SUSE enterprise Linux product family. This is a unique opportunity to use your extensive experience of the enterprise software market and deep understanding of customer requirements to help them transform their IT into the data center of the future and a  software defined infrastructure.</p>\n\n<p>At SUSE, we set challenging goals for ourselves, then work to meet, and often exceed them. How far can you go with extraordinary colleagues at your side?</p>\n\n<p>We are seeking a:</p>\n\n<p>Senior Product Manager for SUSE Linux Enterprise for SAP Applications</p>\n\n<p>This is a dynamic and strategic cross-functional role on the SUSE Product Management Team requiring a strong mix of market, technology and business knowledge. Reporting into the Director of Product Management ñ SUSE Linux Enterprise, the product manager will own the product life-cycle and manage all elements of a product release, including identifying use cases, defining requirements, supporting the technical project managers during the implementation phase, and working with product marketing to introduce the product to market. The abiltiy to focus on the technical and business details of customer user stories to help drive the development process will be critical.</p>\n\n<p>Responsibilities:</p>\n\n<p>In this role, you will</p>\n\n<p>Serve as strong advocate for customers, as well as technology and channel partners of your products in order to build complete solution and service offerings\nDefine, manage and communicate product roadmaps\nWork closely with sales, marketing and business development teams to launch products and drive customer adoption\nRelate to geeks as well as suits. Being comfortable with both techies and business executives, you will be able to build rapport and communicate effectively and at the right level with either group.\nHave the right blend of diplomacy and decisiveness to constantly balance constraints and resources, as well as juggle priorities and tasks. Cost, time, features - you know the triangle.\nOpportunity for global travel to engage with customers, partners and colleagues.</p>\n\n<p>Required Skills:</p>\n\n<p>5+ years of practical Product Management experience involving actual ownership of products and key solution components\nMasters degree or equivalent experience.\nAble to demonstrate a combination of formal business training and good technical understanding across relevant areas\nKnowledge of emerging technologies such as software defined everything\nStrong communications, presentation and interpersonal skills in all settings and across cultures This will include face to face, phone, IM, video link or in front of large audiences\nSelf motivated. Ability to work independently and as a team member</p>\n\n<p>Preferred skills:</p>\n\n<p>Solid understanding of Open Source business models\nFamiliarity with Linux and/or other UNIX like operating systems\nFamiliarity with all aspects of Mission Critical Computing\nFamiliarity with SAP deployments on Unix and/or Linux\nStrong financial skills, including forecasting and trend analysis\nStrong market strategy and marketing skills</p>\n\n<p>About SUSE</p>\n\n<p>SUSE, a pioneer in open source software, provides reliable, interoperable Linux, cloud infrastructure and storage solutions that give enterprises greater control and flexibility. More than 20 years of engineering excellence, exceptional service and an unrivaled partner ecosystem power the products and support that help our customers manage complexity, reduce cost, and confidently deliver mission-critical services. SUSE is also an active member of many open source communities, such as the openSUSE Project, OpenStack, Ceph, OpenNFV, OpenHPC, and more, to help drive collaboration among global communities to help solve some of the worldís most challenging technology issues.</p>\n\n<p>At SUSE, we set challenging goals for ourselves, then work to meet, and often exceed them. How far can you go with extraordinary colleagues at your side?</p>\n\n<p>For more information, visit www.suse.com</p>\n\n<p>Location:\nWalldorf, Baden-W¸rttemberg\nTracking code\n2017306</p>","how_to_apply":"<p>Send CVs to <a href=\"mailto:sylwia.idec@suse.com\">sylwia.idec@suse.com</a></p>","company":"SUSE","company_url":"http://www.suse.com","company_logo":"http://github-jobs.s3.amazonaws.com/c0bdbe04-2898-11e8-9ed0-2b3610f01d77.png","url":"http://jobs.github.com/positions/c99f83ae-2898-11e8-851f-a0e126e705b5"},{"id":"2d172fc8-2898-11e8-9dc4-eb3b63d10e60","created_at":"Thu Mar 15 21:32:14 UTC 2018","title":"Senior Android Developer (i360)","location":"Arlington, VA","type":"Full Time","description":"<p>i360, the leading data and technology provider for the pro-free market public policy and advocacy community, supports organizations that promote free enterprise and smaller government. i360 is a dynamic workplace sitting on the leading edge of public policy, technology, and business, and is seeking team members who are as excited about their cause as they are about building the next generation of political technology. </p>\n\n<p>Application Developers will be integral members of the development team and help build data driven web and mobile application systems.</p>\n\n<p>To be considered, candidates must be creative, passionate about process improvement, and strong technical ability in the following areas:</p>\n\n<p>-Excellent communication and problem-solving skills, with experience interfacing directly with business end-users in design and requirements planning\n-Demonstrable ability to work as part of an integrated solution development team\n-Excellent verbal and written communications skills. Candidates must demonstrate advanced technical writing skills through writing samples.\n-Ability to manage tasks and timelines effectively\n-Passion for free-market principles </p>\n\n<p><strong>A Day In The Life Typically Includes:</strong></p>\n\n<p>-Serve as Applications Developer to support multiple on-going projects as well as develop new -customized applications.\n-Interact with project teams and clients to determine project needs and translate those needs into -robust but simple solutions\n-Help identify the right blend of technologies to make our product successful\n-Document application and data designs for non-technical clients\n-Help promote application and data management best practices on projects</p>\n\n<p><strong>What You Will Need:</strong></p>\n\n<p><strong>Basic Qualifications:</strong></p>\n\n<p>-2+ years experience developing web applications within enterprise architectures </p>\n\n<p>-2+ years experience in Microsoft .NET Technologies and Framework. </p>\n\n<p>-2+ years experience in C#.NET.</p>\n\n<p>-2+ years experience working with Microsoft SQL Server.</p>\n\n<p>-Bachelor's Degree in Computer Science, Computer Engineering, or Engineering  </p>\n\n<p><strong>What Will Put You Ahead?</strong></p>\n\n<p><strong>Preferred Qualifications:</strong></p>\n\n<p>-4+ years experience developing web applications within enterprise architectures </p>\n\n<p>-4+ years experience in Microsoft .NET Technologies and Framework.</p>\n\n<p>-4+ years experience in C#.NET, HTML, JavaScript, and CSS.</p>\n\n<p>-4+ years experience working with Microsoft SQL Server including T-SQL.</p>\n\n<p>-Experience with developing customized application solutions in GIS</p>\n\n<p>Want to learn more about i360?</p>\n\n<p>Salary and benefits commensurate with experience.\nWe are an equal opportunity employer. Minority/Female/Disabled/Veteran Except where prohibited by state law, all offers of employment are conditioned upon successfully passing a drug test. </p>\n\n<p>This employer uses E-Verify. Please visit the following website for additional information: {kochcareers}<a href=\"http://www.kochcareers.com/doc/Everify.pdf\">www.kochcareers.com/doc/Everify.pdf</a></p>","how_to_apply":"<p><a href=\"http://k.rfer.us/KOCH3FlFua\">http://k.rfer.us/KOCH3FlFua</a></p>","company":"i360","company_url":"http://www.i-360.com/","company_logo":null,"url":"http://jobs.github.com/positions/2d172fc8-2898-11e8-9dc4-eb3b63d10e60"},{"id":"160fbe2e-2872-11e8-81b2-043f081a7c3c","created_at":"Thu Mar 15 17:01:03 UTC 2018","title":"Junior Algorithmic Trader","location":"Chicago","type":"Full Time","description":"<p>Responsibilities:</p>\n\n<p>-Work with Senior Algorithmic Traders to assist and learn all facets of automated trading\n-Develop expertise in market microstructure, tick data, and automated trading systems\n-Build and maintain trading quantitative model tools and analytics\n-Develop, code, maintain and support production quality automated trading strategies</p>\n\n<p>Desired Skills and Experience:</p>\n\n<p>-Strong work ethic and willingness to do what it takes to get the job done\n-Passion for math and software applied to markets and trading\n-Strong understanding of computing, math, probability, statistics, and finance\n-Programming proficiency and experience (C++, C#, Python, R).  Linux scripting a plus\n-Excellent verbal and written communication skills\n-Ability to work within a team in a fast paced environment\n-BS, MS, or PhD in technical field or pertinent industry experience</p>","how_to_apply":"<p>Please apply via the following link... <a href=\"https://grnh.se/jseo7jc01\">https://grnh.se/jseo7jc01</a></p>","company":"TransMarket Group","company_url":"http://www.transmarketgroup.com/home/","company_logo":"http://github-jobs.s3.amazonaws.com/084e5fde-2872-11e8-8f8f-25d034eefc59.PNG","url":"http://jobs.github.com/positions/160fbe2e-2872-11e8-81b2-043f081a7c3c"},{"id":"53aa3430-2859-11e8-99df-1c8ffbbe3aed","created_at":"Thu Mar 15 14:05:39 UTC 2018","title":"Backend Developer (Node.js)","location":"Berlin","type":"Full Time","description":"<p>We are looking for a skilled Backend/Node.js Developer to join our team and be responsible for the server-side of our web applications and automation of the default processes.</p>\n\n<p>You will work closely with Product to ensure that our server-side can deliver the features required both for the internal and customer-facing applications and together with our Frontend Developers evolve the core of our REST API.</p>\n\n<p>Your focus will be the evolution of our server-side logic and algorithms, the definition and maintenance of our APIs and databases, and ensure high performance and responsiveness to requests from the frontend.</p>\n\n<p>You have a serious passion for building server-side applications and prefer continuous deployment environments.  You have a background in data and algorithm design and exposure to multi-tiered, microservice based architectures (e.g. through Heroku buildpacks).  Since your work will be supporting frontend technologies a basic understanding of the frontend is necessary.  </p>\n\n<p><strong>What will you do?</strong></p>\n\n<ul>\n<li>Collaborate with product management and frontend engineering to define and implement creative solutions for the product direction, architecture and scalability</li>\n<li>Using Node.js, design, develop and maintain server-side applications using REST APIs to support frontend web apps</li>\n<li>You are proficient with databases and will retrieve data from PostgreSQL and Salesforce</li>\n<li>You have a strong understanding of computer science fundamentals and can implement algorithms like Bin Packing</li>\n<li>You will distribute microservices built with Heroku buildpacks </li>\n<li>Use a test-driven approach, and establish both unit and end-to-end test methodologies</li>\n<li>Build reusable code and libraries for future use</li>\n<li>Design and implementation of data storage solutions</li>\n</ul><p><strong>Do you have?</strong></p>\n\n<ul>\n<li>Strong work experience as a Backend Developer, with hands-on experience with programming languages like server-side JavaScript (node), TypeScript, Python</li>\n<li>In-depth understanding of the entire web development process (design, development and deployment) and basic familiarity with frontend languages</li>\n<li>Deep understanding of common data structures and algorithms, including performance analysis (Big O notation)</li>\n<li>Very familiar with unit and regression testing, with knowledge of widely-used frameworks e.g. Karma/Mocha (JavaScript)</li>\n<li>Knowledge of build and deployment tools, and ability to set up automated testing and deployment of code</li>\n<li>Knowledge of user authentication and authorization between multiple systems, servers, and environments</li>\n<li>Ability to build database schemas that represent and support business processes, and integration of multiple data sources and external services into one system, preferably in PostgreSQL</li>\n<li>Proficient understanding of code versioning tools, such as Git</li>\n<li>Any exposure to Salesforce a serious plus</li>\n</ul><p>Founded by a core team with extensive and deep knowledge of relocation and personal logistics, Relocately is quickly growing to be one of the top tier concierge services for international moves.</p>\n\n<p>Our customer-centric approach focuses on organizing all aspects of every relocation and ensuring our client's belongings are transported safely to your new home. Using modern technology, this happens in a faster and more transparent way than ever before.</p>\n\n<p>We are a team of talented and experienced individuals offering a dynamic, fast-paced work environment. We're free of traditional hierarchies, and have flexible working hours, twice a week company paid lunches via SMUNCH and a truly awesome team.</p>\n\n<p>At Relocately, respect, tolerance and equal opportunities for women and men are part of our organizational culture. We want to promote diversity in our company and oppose any form of discrimination and racism and welcome any application regardless of age, gender, culture, religion, disability, nationality and sexual orientation.</p>","how_to_apply":"<p>Email your resume to: \n<a href=\"mailto:nina.khorasanee@relocately.com\">nina.khorasanee@relocately.com</a></p>","company":"Relocately GmbH","company_url":"http://www.relocately.com","company_logo":"http://github-jobs.s3.amazonaws.com/ac19f80e-2858-11e8-916c-ac3c52252e81.jpg","url":"http://jobs.github.com/positions/53aa3430-2859-11e8-99df-1c8ffbbe3aed"},{"id":"bc35aaf6-26e3-11e8-9c70-3da202124918","created_at":"Tue Mar 13 17:26:59 UTC 2018","title":"Senior Java Backend Engineer – Streaming Platform","location":"Stockholm","type":"Full Time","description":"<p>We are looking for a Senior Java Backend Engineer to join King Stockholm Streaming Platform team.</p>\n\n<p>YOUR ROLE</p>\n\n<p>Your role supports the company in taking real-time actions that optimize our 200+ games for hundreds millions of players using cutting edge technologies.\nYou will also face the challenge of tackling very big and fast data - over 40 billion events received from the games every single day, processed in real-time.\nYou will work closely with fellow data engineers, business intelligence developers, data scientists, business performance managers/directors and game developers across all our game studios.\nYou will among other things:</p>\n\n<ul>\n<li>Develop, maintain and operate our large scale real-time analytics platform in a team of highly skilled engineers</li>\n<li>Improve and automate monitoring and operational processes for our systems</li>\n<li>Research and prototype new backend solutions for data processing, analytics and storage</li>\n<li>Turn ad-hoc data science solutions into efficient, scalable models and applications</li>\n<li>Understand the business context of user requirements and choose the technology and solutions best suited for the purpose.</li>\n<li>Work together with fellow engineers from different teams on joint projects in King analytical space.</li>\n<li>Promote team’s products to a broad audience of both technical and non-technical backgrounds and support/ educate users.</li>\n</ul><p>SKILLS TO CREATE THRILLS</p>\n\n<ul>\n<li>Deep understanding of Java and object oriented design patterns</li>\n<li>Experience with stream processing technologies: Kafka, Storm, Flink or similar</li>\n<li>Experience with Hadoop technologies: HDFS, Yarn, Hive</li>\n<li>Experience working in UNIX environments</li>\n<li>Eagerness to learn and deliver world class services</li>\n</ul><p>A GREAT SAGA NEEDS ALL SORT OF HEROES</p>\n\n<p>Making games is fun. Especially when you do it with people who share the same idea of what makes a good workplace, great. We design games for everyone, no matter where they are or who they are, and we employ all sorts of people from all kinds of backgrounds to bring them to life. Truth is, we simply can’t expect diversity in our players and originality in our games without first nurturing it in our people. A great saga needs all sorts of heroes. And that’s it.</p>\n\n<p>WE’RE SERIOUSLY PLAYFUL</p>\n\n<p>Officially, we’re a leading interactive entertainment company for the mobile world. Unofficially, we’re a serious business that’s not afraid to have fun. Every day at King, we mix intuition with logic, art with science and magic with mathematics to create the games the world loves to play. Together with our parent company Activision Blizzard, our mission is to bring moments of magic to everyday life. If you think this is something you can help us achieve, let’s talk.</p>","how_to_apply":"<p><a href=\"https://king.com/es/jobs/senior-java-backend-engineer-streaming-platform-521?breadcrumbs=/jobs&amp;location=stockholm\">Apply Here</a></p>","company":"King","company_url":"http://www.king.com","company_logo":"http://github-jobs.s3.amazonaws.com/babead30-26e3-11e8-8a20-c7a5ed3f32e6.png","url":"http://jobs.github.com/positions/bc35aaf6-26e3-11e8-9c70-3da202124918"},{"id":"39848410-26e3-11e8-9943-ae592948a069","created_at":"Tue Mar 13 17:24:52 UTC 2018","title":"Software Engineer – Ruby or Python","location":"London, UK","type":"Full Time","description":"<p>Freeformers’ mission is to build a digital economy for all by creating the future workforce now.</p>\n\n<p>As part of our mission, we recently signed a partnership with Facebook to deliver online training to 300,000 young people in six European countries. We are now building the platform for this partnership, an online application for people to learn about a wide range of skills, from empathy and ethical practice, to critical thinking and automation.</p>\n\n<p>We are looking for talented software engineers of all levels of experience to join our team and help us build a learning application that assesses and tracks change in people’s mindset, skillset, and behaviours and helps them build a better career. The application will include interactions with a variety of videos, articles, and infographics, as well as evaluations through questionnaires.</p>\n\n<p><strong>Day to day</strong></p>\n\n<ul>\n<li>Writing and shipping software to hundreds of thousands of users.</li>\n<li>Working as part of a collaborative, agile product team to help refine feature requirements.</li>\n<li>Writing and maintaining automated test suites for our applications.</li>\n<li>Contributing to setting and improving our engineering best practices.</li>\n</ul><p><strong>Requirements</strong></p>\n\n<ul>\n<li>2+ years of experience as a software engineer.</li>\n<li>A knowledge of Ruby on Rails, Python and Django, or similar technologies.</li>\n<li>A proven ability to write, build, and ship production-ready code.</li>\n<li>An understanding of automated testing and software quality.</li>\n<li>A broad knowledge of web technologies and web development.</li>\n<li>Happy to work across various products and services (web, frontend, backend, data processing).</li>\n<li>Experience working in an agile environment.</li>\n</ul><p><strong>Nice to have</strong></p>\n\n<ul>\n<li>Experience with running and deploying systems on AWS.</li>\n<li>Ran A/B tests or other experiments on fast-growing products.</li>\n<li>Worked on systems scaling to hundreds of thousands of customers.</li>\n<li>Worked with Learning Management Systems before.</li>\n</ul><p><strong>Benefits</strong></p>\n\n<ul>\n<li>Enhanced holiday allowance.</li>\n<li>Company pension.</li>\n<li>Company-wide bonus scheme.</li>\n<li>Training budget to support your development.</li>\n<li>Employee assistance programme - including top tips on physical health, work life, wellbeing resources and more.</li>\n<li>Perkbox membership - discounted gyms, restaurants, cinema tickets and more.</li>\n</ul>","how_to_apply":"<p>Apply online at <a href=\"https://freeformers.workable.com/j/97DBB2ABA6\">https://freeformers.workable.com/j/97DBB2ABA6</a></p>","company":"Freeformers","company_url":"https://freeformers.com/","company_logo":"http://github-jobs.s3.amazonaws.com/1fc0b21a-26e3-11e8-870e-0f67363dc1a5.png","url":"http://jobs.github.com/positions/39848410-26e3-11e8-9943-ae592948a069"},{"id":"38ebc35e-26d6-11e8-8276-e94486958715","created_at":"Tue Mar 13 15:51:47 UTC 2018","title":"Engineering Manager","location":"New York","type":"Full Time","description":"<p>THE ROLE</p>\n\n<p>The Engineering team at Mack Weldon is reinventing the buying experience for the category with a best-in-class shopping experience on mobile and web. We are looking for a hands-on Engineering Manager to set and implement a technological and product vision.  </p>\n\n<p>OUR TECHNOLOGY</p>\n\n<p>We are a Ruby on Rails application written on the Spree eCommerce platform.  We have a minimal stack comprised of Rails, MySQL, Redis, AWS buckets, Cloudfront, and a few auxiliary services. We use Marionette/Backbone JS, HAML, SASS and are hosted on Heroku.  We use several great tools for continuous integration, exception monitoring, and system monitoring.  We also have integrations with Avalara, Braintree, Quiet Logistics, Qubit, SailThru, EasyPost, Amazon, Analytics platforms and Desk.  We believe this is the best approach for building an animation rich, mobile first experience that makes buying underwear simpler than checking your bank account balance.</p>\n\n<p>WE ARE LOOKING FOR A STRONG TECHNICAL LEADER WHO</p>\n\n<ul>\n<li>Has a passion for partnering with the business to drive technical direction and context within a growing Engineering team. </li>\n<li>Is eager to create a culture of mentorship and thought leadership within Engineering. </li>\n<li>Is flexible, collaborative and forward thinking. </li>\n<li>Has experience in eCommerce or another high availability, scalable industry. </li>\n<li>Is located in NYC or willing to relocate to NYC. </li>\n</ul><p>WHAT YOU’LL DO EVERY DAY</p>\n\n<ul>\n<li>Manage a team of developers who work heavily in Javascript, Rails, Spree, and our many integrations.</li>\n<li>Be responsible for the database architecture.</li>\n<li>Be in charge of network operations.</li>\n<li>Ensure site structure for scalability.</li>\n<li>Work with our marketing and product teams to define new features and build new buy path flows, landing pages, navigation, internal tools and e-commerce functionality.</li>\n<li>Partner with our design team to execute a high-quality user experience and brand identity.</li>\n<li>Help scale our architecture and improve site performance</li>\n<li>Code and A/B test new features - back-end (Ruby) and front-end (JavaScript / JQuery / CSS)</li>\n<li>Deploy code to production daily </li>\n</ul><p>WHAT WILL SET YOU UP FOR SUCCESS</p>\n\n<ul>\n<li>Extensive experience working with Ruby in a TDD or tested environment</li>\n<li>Full-stack development</li>\n<li>Caching and Scalability in a full stack web application.</li>\n<li>Significant exposure to JavaScript, CSS, MySQL, and mobile web development</li>\n<li>Experience with payment integration, web security, and analytics</li>\n<li>Exposure to any of Spree/Solidus, Resque (or similar), Rspec and Capybara.</li>\n<li>Familiar/Fluent in Amazon Web Services (S3, EC2, Data Pipeline, Redshift, and Cloudfront)</li>\n<li>Exposure to C or C-derivative language.</li>\n</ul><p>WHAT MAKES US SPECIAL?</p>\n\n<p>We give a shit! - We care. We’re slightly obsessive. We sweat every detail. We fight for what we think is best for Mack Weldon and our customers. </p>\n\n<p>We put our money where our mouth is - We own our words. We own our actions. We own our mistakes.</p>\n\n<p>We solve problems - You won’t find us waiting around for someone else to fix a problem, if we can get our hands on it first. </p>\n\n<p>We won’t sacrifice the future for a quick win - We wait for the second marshmallow. </p>\n\n<p>It’s all about the people! - Relationships over transactions.</p>\n\n<p>PERKS</p>\n\n<ul>\n<li>World-class insurance – Top of the line health insurance paid for by Mack Weldon</li>\n<li>Open vacation policy – Unlimited vacation and sick days to use as needed</li>\n<li>Competitive salary – Compensation includes a competitive salary and employee stock options</li>\n<li>Great location – Right in the heart of Manhattan with easy access to 14 different subway lines</li>\n<li>Free Mack Weldon Gear – Free new product launches and year-round employee discount code</li>\n<li>Office Snacks &amp; Drinks – Fully stocked office fridge and pantry with free lunch on Fridays</li>\n<li>Thursday Happy Hour – Beer fridge, wine rack, liquor cabinet, and a spread of tasty treats</li>\n</ul>","how_to_apply":"<p><a href=\"https://boards.greenhouse.io/mackweldon/jobs/932419#.WqfysxPwbBI\">https://boards.greenhouse.io/mackweldon/jobs/932419#.WqfysxPwbBI</a></p>","company":"Mack Weldon","company_url":"http://www.mackweldon.com","company_logo":"http://github-jobs.s3.amazonaws.com/33d2488e-26d6-11e8-95ed-cad503888c97.png","url":"http://jobs.github.com/positions/38ebc35e-26d6-11e8-8276-e94486958715"},{"id":"aeaeabac-26c6-11e8-949a-c3154d237e6f","created_at":"Tue Mar 13 14:03:12 UTC 2018","title":"Admin Support Officer","location":"Edmonton, AB, Canada","type":"Full Time","description":"<p>Our growing team is in search of a friendly and confident individual to help support Customer Service, Credit, Settlements and General Administration which provides a great variety of exposure to the different areas of the business.</p>\n\n<p>Job tasks and responsibilities</p>\n\n<pre><code>Reception and mailing assistance\nData entry into internal and lender contact and loan management systems\nCustomer Relations and Retention such as client correspondence letters and cards\nContacting customers and relationship partners to collect paperwork or provide updates on loan statuses\nAssist with day to day processing for the Customer Service, Credit and Sales teams\n</code></pre>\n\n<p>Skills and experience</p>\n\n<pre><code>Clear and concise communication\nIdeally bilingual\nMicrosoft Office proficient\nProblem solving capabilities\nComposure under pressure\nAbility to work autonomously and as a supportive team play\n</code></pre>\n\n<p>Salary: $35,000 - $45,000</p>","how_to_apply":"<p><a href=\"mailto:rita.martin@lincolnhragensy.com\">rita.martin@lincolnhragensy.com</a></p>","company":"The Lincoln HR Agensy Ltd","company_url":null,"company_logo":null,"url":"http://jobs.github.com/positions/aeaeabac-26c6-11e8-949a-c3154d237e6f"},{"id":"66bc6786-0817-11e7-85ac-a935d69efb5d","created_at":"Tue Mar 13 13:57:02 UTC 2018","title":"Senior Software Engineer","location":"New York","type":"Full Time","description":"<p>We’re looking for great engineers with diverse backgrounds. We need people that can fill hybrid roles with different emphases on the wide context of product development. We don’t have predefined positions: instead, we invite you to come talk to us about your skills, experience, ambitions, and dream role.  We hope to find exceptional people to do exceptional work with us, and we believe it’s important that we define your role and path to our mutual growth together.</p>\n\n<p>Reaktor is a hybrid partner for all things future. We reimagine businesses, and we design and build tomorrow’s digital products. Our full range of consultancy and agency services include expertise from high-level business consulting, to hands-on service and product design and development, to branding and marketing.</p>\n\n<p>We believe in technology-agnostic product thinking, defined only by finding meaningful solutions to challenging problems. Your passion should be the same as ours: unmatched execution of those solutions. We structure, create, iterate, and reinvent, delivering tangible value faster than anyone in the world.</p>\n\n<p>What we can offer you:\nHybrid, completely autonomous teams, filled with experts in everything from design, to data science, to business consulting, to content.\n-A community of amazing people who you will learn from and will learn from you.\n-Experimentation and continuous improvement of our skills and ways of working.\n-A dedication to constant evolution (and the occasional revolution).\n-A world without rigid hierarchy—big ideas can come from anyone and anywhere.\n-Endless fun!</p>\n\n<p>What you’ll bring:\n-Exceptional technological competence.\n-Ability to make things, and to make things happen.\n-Compassion for people—both those around you, and those who will use what we build.\n-Drive to work on complex problems at any part of the project, from type system nuances to organizational dynamics.\n-A vision and commitment to the future of work: being truly lean and agile and human-centered, and leaving yesterday’s pointless rituals behind.\n-Readiness to be responsible for your work, development, and career path. Don’t worry: we’ll have your back in whatever you want to achieve, but the end goal is yours to define.\n-6+ years of real-world experience in building digital products and services.\n-Authorization to work in the United States.</p>\n\n<p>Think Reaktor sounds like home? Great. Introduce yourself via <a href=\"https://www.reaktor.com/careers/senior-software-engineer/?utm_source=github&amp;utm_campaign=2017\">our careers page</a>.</p>\n\n<p>We invite you to share details of any open source projects, your GitHub profile, and most importantly, your personality. Be original, not official.</p>\n\n<p>We are an Equal Employment Opportunity (EEO) employer and do not discriminate on the basis of race, color, national origin, religion, gender, age, veteran status, political affiliation, sexual orientation, marital status or disability.</p>","how_to_apply":"<p>Introduce yourself via <a href=\"https://www.reaktor.com/careers/senior-software-engineer/?utm_source=github&amp;utm_campaign=2017\">our careers page</a>.</p>","company":"Reaktor","company_url":"http://reaktor.com","company_logo":"http://github-jobs.s3.amazonaws.com/48d6475a-0817-11e7-9e18-6aee5b58c18f.png","url":"http://jobs.github.com/positions/66bc6786-0817-11e7-85ac-a935d69efb5d"},{"id":"2f3be538-26c6-11e8-84fa-cf2b3def0ca6","created_at":"Tue Mar 13 13:56:20 UTC 2018","title":"Admin Support Officer","location":"Calagry, AB Canada","type":"Full Time","description":"<p>Admin Support Officer</p>\n\n<p>Our growing team is in search of a friendly and confident individual to help support Customer Service, Credit, Settlements and General Administration which provides a great variety of exposure to the different areas of the business.</p>\n\n<p>Job tasks and responsibilities</p>\n\n<pre><code>Reception and mailing assistance\nData entry into internal and lender contact and loan management systems\nCustomer Relations and Retention such as client correspondence letters and cards\nContacting customers and relationship partners to collect paperwork or provide updates on loan statuses\nAssist with day to day processing for the Customer Service, Credit and Sales teams\n</code></pre>\n\n<p>Skills and experience</p>\n\n<pre><code>Clear and concise communication\nIdeally bilingual\nMicrosoft Office proficient\nProblem solving capabilities\nComposure under pressure\nAbility to work autonomously and as a supportive team play\n</code></pre>\n\n<p>Salary: $35,000 - $45,000</p>","how_to_apply":"<p><a href=\"mailto:rita.martin@lincolnhragensy.com\">rita.martin@lincolnhragensy.com</a></p>","company":"Rita Martin","company_url":null,"company_logo":null,"url":"http://jobs.github.com/positions/2f3be538-26c6-11e8-84fa-cf2b3def0ca6"},{"id":"513f9876-26be-11e8-9ea8-2394da4fc832","created_at":"Tue Mar 13 13:14:21 UTC 2018","title":"Senior Developer (.NET API)","location":"Remote - US","type":"Full Time","description":"<h2><strong>Who We Are</strong></h2>\n\n<p>The TriCap Technology Group (\"TriCap\") is a financial technology firm that uses comparative and predictive data analytics to optimize health systems revenue and medical receivables' performance.</p>\n\n<p>TriCap's core product, the ARxChange® System, is a cloud-based guided analytics product family that is paired with market-exchange and interpretative financial management techniques that together isolate, quantify, and prioritize revenue growth, cost reduction, and the elimination of leakage sources within a health systems revenue cycle and receivables disposition work flow.</p>\n\n<p>We are a small, dedicated team that is committed to delivering quality service to our clients.  Our IT team focuses on supporting our existing processes while also developing new product lines and enhanced feature sets.  We are geographically remote, but we work closely to solve problems, design innovative solutions, and create great software.</p>\n\n<h2><strong>Job description</strong></h2>\n\n<p>Senior Developers at ARxChange are technical experts.  Their primary role is designing and developing software. They will also use their experience to help other team members solve complex problems and design quality solutions.  Each Senior Developer focuses on their specific areas of technical expertise, but they are also cross-trained to have a working knowledge other areas in the tech stack as well.</p>\n\n<p>Senior Developers report to the Chief Technology Officer, and work together to understand current business needs, technical designs, and IT priorities.  On a day to day basis, they have a fair amount of independence and responsibility for their ongoing projects and tasks.  They will often work with other team members to solve problems, mentor less experienced developers, and participate in software design sessions with IT leadership.  Strong communication skills are particularly important for our Senior Developers.</p>\n\n<p>Specific Position:  This position will focus on our client facing .NET REST APIs and our back-end .NET services.  These web services use some of the latest versions of the .NET framework and .NET core.  This position will work directly with our MS SQL Server DB, SSIS packages, and other data tools, so familiarity with database technologies, design, and best practices is important.</p>\n\n<p>While this position primarily focuses on .NET Web API development, we also have client facing web portals and upcoming mobile app development, so some front-end development experience may be expected.</p>\n\n<h2>Position Responsibilities:</h2>\n\n<ul>\n<li>Design and develop software for new and existing products</li>\n<li>Work with IT leadership and business counterparts to understand business goals and requirements</li>\n<li>Give reasonable work estimates on project tasks and milestones, and then adhere to them.</li>\n<li>Perform code reviews for other developers' code and unit tests, and have your code and unit tests reviewed where appropriate before the build and deploy process</li>\n<li>Work with third party vendors to define requirements and integrate software products</li>\n<li>Communicate milestone progress, roadblocks, and issues</li>\n<li>Participate in blameless post-mortems for production issues</li>\n<li>Pair program with other developers and team members, especially in areas of expertise</li>\n<li>Document code through code comments and technical documentation</li>\n<li>Stay up-to-date on latest frameworks and best practices</li>\n<li>Protect secure operational data, private code, and intellectual property of the company.</li>\n<li>Adhere to company policies and procedures for privacy, security, change management, etc.</li>\n</ul><h2>Candidate Qualifications:</h2>\n\n<ul>\n<li>At least 5 years of experience as a professional software developer</li>\n<li>At least 2 years of experience with .NET MVC or Web API</li>\n<li>A BS in Computer Science or related degree (or equivalent training and experience)</li>\n<li>Experience with Healthcare and/or Financial IT preferred</li>\n<li>Ability to work remotely from home</li>\n<li>Strong verbal and written communication skills</li>\n<li>Full-Time Employee - Not a Contractor position</li>\n<li>Candidate Must be Authorized to work in the US</li>\n</ul><h2>Required Technology Experience:</h2>\n\n<h2></h2>\n\n<ul>\n<li>.NET Framework and .NET Core</li>\n<li>C#</li>\n<li>MVC and .NET Rest APIs</li>\n<li>MS SQL Server</li>\n<li>SQL Server Add-Ons (SSIS, R Integration, etc)</li>\n<li>Entity Framework</li>\n</ul><h2>Preferred Technology Experience:</h2>\n\n<h2></h2>\n\n<ul>\n<li>HL7</li>\n<li>Qlik</li>\n<li>Angular JS</li>\n<li>HTML + JavaScript + CSS</li>\n<li>Docker Containers</li>\n<li>Team City Deploy</li>\n<li>AWS Cloud Infrastructure</li>\n</ul>","how_to_apply":"<p>Email your Resume, Cover Letter, and contact information to <a href=\"mailto:careers@arxchange.com\">careers@arxchange.com</a></p>","company":"TriCap Technology Group","company_url":"https://arxchange.com/","company_logo":"http://github-jobs.s3.amazonaws.com/e6612482-261f-11e8-9439-6501cc41c9c5.png","url":"http://jobs.github.com/positions/513f9876-26be-11e8-9ea8-2394da4fc832"},{"id":"6875a8e2-25d2-11e8-85e8-8b7fc4436797","created_at":"Mon Mar 12 08:52:08 UTC 2018","title":"Global Head of Data","location":"Singapore","type":"Full Time","description":"<p>The role\nSummary:\nTake ownership, train and grow the data engineering and statistical learning (\"data science\") team of the largest Logistics company in South East Asia, covering a population three times the size of US’. We are headquartered above Tanjong Pagar in Singapore, with a great view and year round warm weather.</p>\n\n<p>Situation:\nAlibaba Group has injected two billion dollars into Lazada Group, a South East Asian conglomerate whose logistics arm, Lazada eLogistics (LeL), provides end to end logistics services and acts as a logistics marketplace.</p>\n\n<p>LeL is a data driven business, but the data function is still embryonic. Our CEO and CTO themselves are pushing for the creation of a dedicated data engineering and data science team to take its place at the centre of the company. </p>\n\n<p>A data warehouse project has begun, with 20 systems' backend databases replicated hourly or live into a multi-TB PostgreSQL instance. A \"clean\" (normalised) schema is created from it, a set of views that organises the data into a form that represents the real logic of the business cross-systems. The \"raw\" schema contains all the replicated databases, the \"logical\" schema contains the cross-system normalised information, and we're now building the part that gets from the first to the second. The result will be one of the largest <em>relational</em> PostgreSQL deployment in the world.</p>\n\n<p>The next compulsory steps will be:</p>\n\n<ul>\n<li>To complete writing the raw-to-logical mapping, thus modelling and implementing a clean view of all the company's information.</li>\n<li>To assist, train, mentor and otherwise lead the existing team into completing the mapping.</li>\n<li>To replicate the functional spec of all existing data products within the company (mostly reports).</li>\n<li>To expand the team to cover skillsets not currently present or trainable.</li>\n<li>To build and provide the ability for the team to answer any question from any part of the business promptly and correctly (such as \"what is the average time a package between 2 and 5kg spends being picked in cold storage zones between 9 and 11am in Thailand and Myanmar a week after Chinese New Year\").</li>\n</ul><p>Optional paths thereafter could be:</p>\n\n<ul>\n<li>To assist the CEO and CTO with their existing statistical learning projects, such as optimising the routing of millions of packages through multiple transport companies and warehouses internationally.</li>\n<li>To think of, develop and deploy other data-driven projects such as optimising warehouse picking operations or inventory management.</li>\n<li>To train local teams capable of doing the same independently, and support their efforts. This involves travelling around Asia.</li>\n</ul><p>Likely useful experience:</p>\n\n<ul>\n<li>Software development (aside from building actual software, you'll need to read a lot of code to understand systems whose logic is not at database level).</li>\n<li>A mathematical bend, including awareness of and respect for the ideas behind the relational model (\"predicate logic on sets\") as defined by Edgar Codd and Chris Date, and rich data types. If you see a foreign key as a mathematical domain and think in terms of relation values and variables, we are probably on the same page.</li>\n<li>Knowing your way around PostgreSQL, or failing that any large scale RDBMS deployment; there are infrastructure teams and DBAs but they need your guidance.</li>\n<li>At least some enjoyment of the resolution of large, complex problems using more abstract methods as opposed to quick hacks and duct tape.</li>\n<li>UNIX/Linux, but if you've read that far you probably have more than enough experience. </li>\n<li>Speaking Chinese (Mandarin) may help a bit but the team has multiple native speakers.</li>\n</ul><p>Interview process:</p>\n\n<ul>\n<li>Email <a href=\"mailto:vanessa.tan@lazada.com\">vanessa.tan@lazada.com</a> to be sent a few quick questions. Include \"6h9mYszLTq2Y\" in the subject line so we know you're not a bot.</li>\n<li>An hour or two over Skype for probing your technical experience.</li>\n<li>An hour or two in Singapore (if you are there) or over Skype for the C-levels to figure out if they can work with you.</li>\n</ul>","how_to_apply":"<p><a href=\"mailto:vanessa.tan@lazada.com\">vanessa.tan@lazada.com</a></p>","company":"Lazada Services SEA","company_url":"http://www.lazada.com","company_logo":"http://github-jobs.s3.amazonaws.com/600adc54-25d2-11e8-8427-e416870920b5.jpg","url":"http://jobs.github.com/positions/6875a8e2-25d2-11e8-85e8-8b7fc4436797"},{"id":"cc045588-25c9-11e8-85b9-971b619662a6","created_at":"Mon Mar 12 07:50:07 UTC 2018","title":"Software Engineer (m/f)","location":"Dresden","type":"Full Time","description":"<p>Your tasks:</p>\n\n<ul>\n<li>Design, modeling, and implementation of all backend parts of LOVOO</li>\n<li>Development of innovative features for the dating sector in agile and cross functional teams</li>\n<li>Active increase of code quality through application of XP (e.g. TDD, refactoring, pair programming and CI/CD)</li>\n<li>Collaborative development of deployment pipelines and runtime environments in the cloud (GCP) in cooperation with our Site Reliability Engineers</li>\n<li>Regular training and continuous knowledge exchange through in-house tech talks, in-house training and communities</li>\n<li>Participation in hackathons as well as national and international conferences</li>\n</ul><p>Our requirements: </p>\n\n<ul>\n<li>Relevant knowledge in dealing with PHP/Go or at least two high programming languages such as Python, Ruby, Rust, C/C++ or Erlang</li>\n<li>Experience in development of medium/large-scale web applications and distributed systems</li>\n<li>Secure handling of common design and architectural patterns</li>\n<li>Knowledge of various backend technologies (e. g. microservices, docker, gRPC, HTTP/2.0, SQL, Redis/memcached) </li>\n<li>Sound knowledge of common algorithms &amp; data structures</li>\n<li>Hands-on mentality in working in a cloud environment (like AWS, GCP)</li>\n<li>Practical experience in agile software development and process management (Scrum/Kanban) and ideally also in working in cross-functional teams</li>\n<li>Experience with Kubernetes, Cassandra, Redis , PostgreSQL, MongoDB, Google BigQuery, or Google Spanner is a plus</li>\n<li>Independent, reliable and structured way of working</li>\n<li>Interest in Open Source as well as willingness for continuing education</li>\n<li>Sense of humor and excellent communication skills in German or English</li>\n</ul><p>We offer:</p>\n\n<ul>\n<li>Attractive and competitive salary as well as participation in success</li>\n<li>Develop and define areas of responsibility directly by implementing your own ideas as well as by taking the lead for independent projects</li>\n<li>Modern Offices with a pool table, Foosball and ergonomic office equipment right in the heart of the cities of Dresden and Berlin</li>\n<li>Flexible working hours, Home Office when needed and an equilibrium of work and life</li>\n<li>Professional and personal development through feedback talks, language classes, MOOC fee reimbursements (e. g. Coursera) as well as in-house events such as ThunderTalks, Showtime, Open Space Days or the LOVOO Compass</li>\n<li>A motivated and multicultural team with familial spirit</li>\n<li>Cross-departmental communication and knowledge sharing as well as learning directly in cross-functional teams and an US exchange programs with our parent-company ‘The Meet Group’</li>\n<li>Opportunity to attend and speak at international conferences &amp; local meetups</li>\n<li>Assistance with relocation for internationals</li>\n<li>A rich culinary variety with regular lunch and dinner offers as well as a comprehensive selection of drinks</li>\n<li>Diverse sports &amp; health offerings plus our own LOVOO Gym</li>\n</ul>","how_to_apply":"<p><a href=\"https://inside.lovoo.com/en/job/software-engineer-mf/\">https://inside.lovoo.com/en/job/software-engineer-mf/</a></p>","company":"LOVOO GmbH","company_url":"https://inside.lovoo.com/","company_logo":"http://github-jobs.s3.amazonaws.com/64c0eda4-25c5-11e8-85d4-bba6dc49fccd.png","url":"http://jobs.github.com/positions/cc045588-25c9-11e8-85b9-971b619662a6"},{"id":"265a1122-2399-11e8-96dd-04d58ab4e07c","created_at":"Fri Mar 09 12:57:10 UTC 2018","title":"DevOps Engineer Inhome Multimedia","location":"Den Haag","type":"Full Time","description":"<p><b>DevOps Engineer Inhome Multimedia</b><br></p>\n\n<p>Jij bent als Devops Engineer Inhome Multimedia verantwoordelijk voor de ontwikkeling maar ook de optimalisering van ons huidige en toekomstige state-of- the-art InHome dienstverlening bij onze klanten thuis, waarbij je optimaal gebruik gaat maken van nieuwe ontwikkelingen en mogelijkheden als virtualisatie en automatisering.<br></p>\n\n<p><b>Hoe?</b> Door de nieuwste technieken toe te passen in zowel de innovation als de operations van het InHome klantnetwerk en diensten<br></p>\n\n<p><b>Waarom?</b> KPN brengt haar klantnetwerk naar de nieuwste generatie: een netwerk dat meebeweegt met de wensen van onze klanten en klaar is voor de toekomst.<br></p>\n\n<p><b>Waar?</b> Maanplein in Den Haag<br></p>\n\n<p><b>Met wie?</b> Met zo’n 50 collega’s van Network Innovation, verdeeld over 6 Agile teams van 7 tot 9 engineers sterk.<br></p>\n\n<p><b>Zijn InHome beheer oplossingen, continuous integration en state-of- the-art klantnetwerken en diensten echt jouw ding? Wij zijn op zoek naar toekomstige network engineers om het InHome team te versterken.</b><br></p>\n\n<p><b>Als DevOps Engineer Inhome Multimedia…</b><br>\n… voer je zowel innovation als operations van het InHome netwerk uit. Je houdt je bezig met:<br></p>\n\n<ul>\n<li>ontwerpen, implementeren, testen en beheren van InHome-apparatuuur (o.a. Mediaboxen), -netwerk en -diensten en hebt hier al enkele jaren ervaring mee<br>\n</li>\n<li>automatiseren en standaardiseren van InHome netwerken en processen op basis van Continuous Integration (CI) en Continuous Delivery (CD)<br>\n</li>\n<li>bestaande KPN en open source tools<br>\n</li>\n<li>ontwikkelen van H/FaaS functionaliteit<br>\n</li>\n</ul><p><b>Wat verwachten wij van jou?</b><br>\nAls ervaren DevOps Engineer weet jij als geen ander hoe snel de technische wereld draait en hoe hier zonder moeite op te anticiperen. Je hebt reeds enkele jaren ervaring met (InHome) netwerken, beheer en/of software ontwikkeling. Je werkt snel en levert hoge kwaliteit in een dynamische omgeving. Daarnaast heb je een sterke passie om tools en systemen te bouwen die andere collega’s in staat stellen om nog sneller en beter te werken.<br></p>\n\n<p>Wil je slagen in deze functie, dan ben je op meerdere van de onderstaande punten vaardig:<br></p>\n\n<ul>\n<li>Algemene methodieken als ontwikkeling, testen, security, BPMS, BCM, ITIL, data analyse en log management<br>\n</li>\n<li>Kennis van C/C++/C#, Linux, SDK, versiebeheer<br>\n</li>\n<li>Beheersen van diverse InHome apparatuur en functies, WiFi, IOT, PLC, TR69, NetConf/Yang<br>\n</li>\n<li>OpenStack, Python, YAML data standards, Vswitch, Containers<br>\n</li>\n<li>Bekend met Software Defined Networking en het toepassen hiervan<br>\n</li>\n<li>Kennis van Automatic Production Management: ETSI (open source) MANO, TOSCA testtooling, Ansible App automation<br>\n</li>\n</ul><p><b>Dit krijg je ervoor terug</b><br>\nNaast dat je deel uitmaakt van een gedreven team met talentvolle collega’s en werkt bij een bedrijf dat volop in de ontwikkeling zit van telecombedrijf naar Digital Telco, bieden we je het volgende:<br></p>\n\n<ul>\n<li>Een uitdagende, zelfstandige én flexibele functie met doorgroeimogelijkheden (KPN Academy)<br>\n</li>\n<li>Primaire en secundaire arbeidsvoorwaarden conform KPN CAO<br>\n</li>\n<li>Je ontvangt een marktconform vast salaris, 37-urige werkweek, mobiele telefoon en laptop, een toeslag van 12,5% van je bruto maandsalaris (CAO budget), 50% korting op KPN producten en diensten, vergoeding van de reiskosten woning-en werk en uitstekende pensioenvoorwaarden.<br>\n</li>\n<li>Je hebt goede doorgroei- en opleidingsmogelijkheden (KPN Academy) en een jaarlijks persoonlijk opleidingsbudget van € 1.000,-. Sterker nog, we verwachten van jou dat jij je blijft ontwikkelen.<br>\n</li>\n</ul><p><b>Wie zijn wij?</b><br>\nDe afdeling Access &amp; Core Network Innovation zorgt ervoor dat het KPN-netwerk voldoet aan de nieuwste ontwikkelingen en de wensen van onze klanten. Wij zijn een innovatief team dat de transitie van traditionele netwerkdiensten naar netwerkfunctievirtualisatie uitvoert. We brengen het vaste en mobiele KPN-netwerk naar de nieuwste generatie: een netwerk dat meebeweegt met de wensen van onze klanten en klaar is voor de toekomst.<br></p>\n\n<p>In het team waar je onderdeel van wordt, is de transitie die KPN maakt naar Digital Telco goed merkbaar. Vanuit Den Haag werken ervaren specialisten in hoog tempo aan deze voor de telecomwereld impactvolle ontwikkeling. Je werkt samen met internationale collega’s van KPN en haar partners. Dat levert een dynamische, energieke en leerrijke omgeving op. Voor jou én voor de toekomst van KPN.<br></p>\n\n<p><b>Meer informatie of solliciteren?</b> Ben je die toekomstige DevOps Engineer met passie voor Inhome Multimedia en ga jij het verschil maken in deze functie? Wij zien je sollicitatie graag tegemoet via het sollicitatieformulier. Voor meer informatie over deze functie of sollicitatieprocedure kun je contact opnemen met Aladar Horsky, KPN ACN Innovation, via telefoonnummer +31637471807of via e-mail aladar.horsky@kpn.com.<br></p>\n\n<p><a href=\"https://kpn.redirect.your-jobresponse.com/devops_engineer_inhome_multimedia_den_haag/195793/V819/solliciteren\">Klik hier voor het sollicitatieformulier!</a></p>\n\n<p><i>Een (e-)assessment en screening zijn onderdeel van het sollicitatieproces van KPN.</i><br></p>\n\n<p><i><b>Acquisitie naar aanleiding van deze vacature wordt niet op prijs gesteld.</b></i><br></p>","how_to_apply":"<p><a href=\"https://kpn.redirect.your-jobresponse.com/devops_engineer_inhome_multimedia_den_haag/195793/V819/solliciteren\">Klik hier voor het sollicitatieformulier!</a></p>","company":"KPN","company_url":null,"company_logo":"http://github-jobs.s3.amazonaws.com/1aa67096-2399-11e8-99f4-7ee2d9ae5a11.jpg","url":"http://jobs.github.com/positions/265a1122-2399-11e8-96dd-04d58ab4e07c"},{"id":"cbe3893e-22b8-11e8-833e-d492d04d023a","created_at":"Fri Mar 09 12:49:09 UTC 2018","title":"Software Architect","location":"Remote","type":"Full Time","description":"<p>We are an engineering-first company, building the future of banking information exchange.  We are looking for an experienced software architect to join our small and fast-paced team. In this position, you'll be designing and building the platform that will be the backbone of the next generation of customer focused banking applications. </p>\n\n<p>Please apply if you have experience:</p>\n\n<ul>\n<li>Building digital banking and/or payment systems</li>\n<li>If you have knowledge of open banking</li>\n<li>Strong cryptography knowledge is a plus and/or have worked on E2E encryption</li>\n<li>Developing/Authoring APIs or Data Schemas</li>\n</ul><p>Responsibilities:</p>\n\n<ul>\n<li>Write and/or review technical specification documentation which may include architecture design, interfaces design, data modelling, and or data flow diagramming.</li>\n<li>Research and develop proof of concepts around key product questions such as encryption, security protocols and data processing.</li>\n<li>Development using Python Django.</li>\n</ul><p>You will have the option of working remotely with flexible hours, and will participate in monthly team meetups at our London offices. </p>\n\n<p>How to apply\nIf you cover at least some of the above points, we want to talk with you. Let us know that you exist by sending a short email telling us about yourself and attach a résumé to jobs@studioh67.com. </p>\n\n<p>If you cover at least some of the above points, we will organise a call and schedule a short two to four hour activity. If after that, we still like one another - welcome onboard!</p>\n\n<p>We offer generous salary and benefits compared to industry standards, all you have to do is show us how much you are worth! </p>\n\n<p>ABOUT US</p>\n\n<p>We’re a startup. We’re funded. And we have a client. We’re a group of founders who have built companies together and are committed to building amazing teams. This is our next venture. There is an opportunity for real involvement at all levels, shaping the direction and genuinely building a rocket ship. We guarantee it won’t be boring.</p>","how_to_apply":"<p>If you cover at least some of the above points, we want to talk with you. Let us know that you exist by sending a short email telling us about yourself and attach a résumé to <a href=\"mailto:jobs@studioh67.com\">jobs@studioh67.com</a></p>","company":"StudioH67","company_url":null,"company_logo":null,"url":"http://jobs.github.com/positions/cbe3893e-22b8-11e8-833e-d492d04d023a"},{"id":"d3561f22-2382-11e8-93bc-c9d0d80b5c8a","created_at":"Fri Mar 09 10:17:52 UTC 2018","title":"Senior Backend Developer (PHP)","location":"Rotterdam","type":"Full Time","description":"<p><i>You are a technically curious Backend PHP Developer that wants to be part of a core development product team. You do understand (and maybe even already have experience with) the power of things like TDD, DDD, CQRS ? Then apply for the position of Senior Backend Developer (PHP) at VONQ and be part of our team that builds our flagship product, tools and APIs that serve global customers! #gettingthingsdoneright</i>\n</p><p>\n<b>Senior Backend Developer (PHP)</b><br><i>Rotterdam, fulltime position (32 - 40), starting ASAP </i>\n</p><p>\n<b>Description</b><br>\nAs a Senior Backend Developer in the VONQ Product Team, you will be leading critical product development efforts and get your hands dirty in the implementation of various applications/services. <br>You'll be working closely with our CTO and our product management team. \n</p><p>\nYou will be contributing to our flagship product called Job Marketing Platform (JMP). It’s a (big) data-driven application with a recommendation engine to serve multiple personas. JMP incorporates the team’s learnings and best practices including CQRS and event sourcing. Although it’s a young product we’re practicing LEAN methodology to gradually evolve it in a modular way and having a very ambitious roadmap in mind. \n</p><p>\n<b>What you actually will do</b><br></p>\n\n<ul>\n<li>Work in an agile (scrum) environment and deliver high quality applications/services<br>\n</li>\n<li>Pro-actively lead development efforts for new product initiatives and feature development<br>\n</li>\n<li>Mentor and support team members<br>\n</li>\n<li>Support the devops team in utilizing practices such as CI, CD, and automated release management<br>\n</li>\n<li>Write robust and efficient code primarily using PHP, Symfony and MySQL, and learn other languages/frameworks if needed<br>\n</li>\n</ul><p><b>Which boxes do you tick?</b><br><i>(Psst...You do not need to tick all the boxes below in order to apply...)</i><br>\nThis describes the ideal candidate, but above all we value people that have an appetite to excel, and the potential to succeed.</p>\n\n<p><b>What we need</b><br></p>\n\n<ul>\n<li>Bachelor degree or equivalent relevant work experience<br>\n</li>\n<li>Creating high quality multi-tiered applications primarily preferably with PHP and MySQL<br>\n</li>\n<li>Experience with Symfony2 and Domain Driven Design<br>\n</li>\n<li>Experience in contributing to the systems and software architecture of a company<br>\n</li>\n<li>Experience leading team development efforts to implement new product initiatives and features<br>\n</li>\n<li>Experience with Agile methodologies (Scrum / Kanban)<br>\n</li>\n<li>Experience with practices such as TDD, CI and CD<br>\n</li>\n<li>Experience with automated testing using tools such as PHPUnit, PHPSpec and Behat<br>\n</li>\n<li>Excellent communication skills in English<br>\n</li>\n<li>An Agile mindset: being able and willing to cross roles and specialities to make the team succeed<br>\n</li>\n</ul><p><b>Bonus points</b><br></p>\n\n<ul>\n<li>Experience with devops and infrastructure practices and technology like deployment automation, provisioning etc. in a safe, reliable way<br>\n</li>\n<li>Understanding of design patterns such as event sourcing and CQRS, and you know when to apply them<br>\n</li>\n<li>Experience with REST API design<br>\n</li>\n<li>Experience with Elasticsearch<br>\n</li>\n<li>Worked as part of a distributed (or international) team<br>\n</li>\n<li>Enthusiasm to bring new ideas and share your knowledge with the team<br>\n</li>\n</ul><p><b>Things we cherish</b><br></p>\n\n<ul>\n<li>Business-centric thinking, and a goal driven personality<br>\n</li>\n<li>Entrepreneurial spirit<br>\n</li>\n<li>Technical curiosity, critically open to new tools and technologies<br>\n</li>\n<li>Passion for creating an elegant systems architecture<br>\n</li>\n<li>Lame jokes (what can I say...) &amp; beer on Fridays and often BBQs at our terrace ;-)<br>\n</li>\n</ul><p><b>What’s in it for you</b><br>\nFirst of all, you’ll be working with experienced colleagues with a strong vision on web development and software architecture, giving you a full intellectual challenge every day. Secondly you will be part of a vibrant and ambitious team of 12 different nationalities in a very casual environment. Thirdly, you'll have the opportunity to participate in meetups/conferences.</p>\n\n<p>We often have a BBQ (and beers) on our terrace at the office and multicultural potluck lunches. Oh.. and you will have fun! </p>\n\n<p><b>What’s more</b><br></p>\n\n<ul>\n<li>Laptop of your preferences and two extra screens on your desk<br>\n</li>\n<li>Flexible working hours<br>\n</li>\n<li>Time and budget for training<br>\n</li>\n<li>5 weeks paid holiday per year<br>\n</li>\n<li>Good salary and additional incentives<br>\n</li>\n<li>Fixed term contract with an option for perm<br>\n</li>\n<li>Support with relocating<br>\n</li>\n</ul><p><b>So, does this sounds appealing to you?</b><br>\nPlease apply by using the application form!</p>\n\n<p><a href=\"https://vonq.redirect.your-jobresponse.com/senior_backend_developer_php_rotterdam/191221/V819/apply\">Click here for the application form!</a></p>\n\n<p>If you have any questions, please send an email to Sarah (Recruiter) -&gt; <a href=\"mailto:sarahellithy@vonq.com\">sarahellithy@vonq.com</a>.</p>\n\n<p><i>Agencies hold your horses: unsolicited CV’s are dropped by our SPAM filters.</i></p>\n\n<p><i>Keywords: vacancy, job, Rotterdam, PHP, Backend, Software Developer, Web Developer, Product Engineer, Symfony, CQRS</i></p>","how_to_apply":"<p><a href=\"https://vonq.redirect.your-jobresponse.com/senior_backend_developer_php_rotterdam/191221/V819/apply\">Click here for the application form!</a></p>","company":"VONQ","company_url":"http://www.vonq.com","company_logo":"http://github-jobs.s3.amazonaws.com/c9a44292-2382-11e8-9ce4-40ad7b240a96.jpg","url":"http://jobs.github.com/positions/d3561f22-2382-11e8-93bc-c9d0d80b5c8a"},{"id":"04b675e2-2335-11e8-82e2-16702cee4ab6","created_at":"Fri Mar 09 00:59:39 UTC 2018","title":"Full-Stack Engineer","location":"San Francisco (Remote)","type":"Full Time","description":"<p>Interested in contributing across the complete stack on a system that will transform how user data will be managed for every consumer app across the web?</p>\n\n<p>We're looking for a <strong>seasoned full-stack engineer</strong> who has ideally worked in both small scrappy teams, as well as larger structured team. Someone who is comfortable up and down the stack and has the ability to own features.</p>\n\n<p>We look for self-starters and an entrepreneurial mentality. We ship every week. You should be someone that likes to ship and can work with our entire stack - Python, Javascript(multiple frameworks), Flask. </p>\n\n<p><strong>The role</strong>: \nWork with our product, design, and engineering teams to understand experiences and goals and execute world-class code. </p>\n\n<p><strong>Your background</strong>  </p>\n\n<ul>\n<li>A full-stack generalist with deep experience building web applications</li>\n<li>Comfortable working with everything from CSS to API’s</li>\n<li>You’ve built and managed a large scale code base</li>\n<li>Self starter with an entrepreneurial mindset and a passion for excellence</li>\n<li>Ability to excel in a distributed team</li>\n<li>Strong verbal and written communication skills</li>\n</ul><p>Big Plus:</p>\n\n<ul>\n<li>Open source experience</li>\n<li>Blockchain experience: Solidity Smart Contracts, IPFS: the more experience the better.</li>\n</ul><p><strong>Benefits</strong>:</p>\n\n<p>Token package: you will receive tokens as a part of your comp package. </p>\n\n<p>Remote: we are headquartered in San Francisco, but the majority of our team is remote. Whether in SF or not, you will have the opportunity to work the majority of your week in a remote capacity.</p>\n\n<p>Following: dock.io has one of the largest and fastest growing communities in crypto, as well as an \"alpha\" app, which is growing by more than 3,000 new registered users per day.</p>\n\n<p>Company retreat: annual team retreat in an international location.</p>","how_to_apply":"<p>Email <a href=\"mailto:jobs@dock.io\">jobs@dock.io</a> with the following:</p>\n\n<ul>\n<li>Why you'd be a great fit for this role</li>\n<li>Why you'd like to work for dock.io</li>\n<li>Your current location</li>\n<li>Link to your Github profile</li>\n<li>Link to your LinkedIn profile (optional)</li>\n</ul>","company":"dock.io","company_url":"https://dock.io/","company_logo":"http://github-jobs.s3.amazonaws.com/fa96d17e-2334-11e8-9ba7-5f2aa384a31c.png","url":"http://jobs.github.com/positions/04b675e2-2335-11e8-82e2-16702cee4ab6"},{"id":"1a847c4e-2334-11e8-9c24-a3dc567273db","created_at":"Fri Mar 09 00:53:32 UTC 2018","title":"Head of Engineering","location":"San Francisco","type":"Full Time","description":"<p>We're looking for a <strong>Head of Engineering</strong> to lead our growing engineer team who is excited about leading engineering efforts for a system that will transform how user data will be managed for every consumer app across the web.</p>\n\n<p>Someone who is a seasoned professional who has ideally worked in both small scrappy teams, as well as larger structured team. Someone who is capable of solving complex computer science problems and not afraid to roll up their sleeves.</p>\n\n<p><strong>About You</strong>:</p>\n\n<p>Effective team builder: not your first rodeo. You know how to effectively build a world-class engineering team, and do not need a Facebook budget to do it.</p>\n\n<p>Well versed with API's: you're an expert at understanding and writing API's, and enjoy creating maintainable and scalable systems.</p>\n\n<p>Excellent communication skills: ability to effectively manage communication between engineers, stakeholders, and product teams in a remote capacity.</p>\n\n<p>Multi-task: you're able to effectively manage and lead multiple projects.</p>\n\n<p>Adaptable: ability to adjust and stay agile while scaling an organization. </p>\n\n<p>Blockchain: Blockchain, Solidity Smart Contracts, IPFS: the more experience the better.</p>\n\n<p><strong>Benefits</strong>:</p>\n\n<p>Token package: you will receive tokens as a part of your comp package. If you're familiar with blockchain you know this is 10x better than stock options.</p>\n\n<p>Remote: we are headquartered in San Francisco, but the majority of our team is remote. Whether in SF or not, you will have the opportunity to work the majority of your week in a remote capacity.</p>\n\n<p>Following: dock.io has one of the largest and fastest growing communities in crypto, as well as an \"alpha\" app, which is growing by more than 3,000 new registered users per day.</p>","how_to_apply":"<p>Email <a href=\"mailto:jobs@dock.io\">jobs@dock.io</a> with the following:</p>\n\n<ul>\n<li>Why you'd be a great fit for this role</li>\n<li>Why you'd like to work for dock.io</li>\n<li>Your current location</li>\n<li>Link to your Github profile</li>\n<li>Link to your LinkedIn profile (optional)</li>\n</ul>","company":"dock.io","company_url":"https://dock.io","company_logo":"http://github-jobs.s3.amazonaws.com/7620801c-2333-11e8-8818-0c005ac94010.png","url":"http://jobs.github.com/positions/1a847c4e-2334-11e8-9c24-a3dc567273db"},{"id":"6b30596c-2332-11e8-8189-113b9f4337c4","created_at":"Fri Mar 09 00:40:27 UTC 2018","title":"Senior Database Reliability Engineer ","location":"Remote ","type":"Full Time","description":"<p><b>About the Role</b></p>\n\n<ul>CircleCI is seeking its first Database Reliability Engineer to work closely with our Site Reliability and Software Engineers to deliver and manage the high-performance and scalable data persistence layer underlying our multi-tenant Cloud offering as well as our Server-installed, on-premises solution. You will not only have the chance to automate and optimize infrastructure through the construction of appropriate tooling, but you will help software engineers through the design phase to select, design, and optimize the data persistence for their services.</ul><p>CircleCI uses multiple datastores to support its platform, including Postgres, Mongo, and Redis.</p>\n\n<p><b>About CircleCI</b></p>\n\n<ul>Velocity is critical for software teams in today's competitive landscape, but maintaining speed can be difficult as apps and systems grow larger and more complex. CircleCI’s platform allows developers to rapidly release code (for web and mobile apps) they trust by automating the build, test, and deploy process. CircleCI enables developers to detect and fix bugs before they even reach customers. Thousands of leading companies including Facebook, Kickstarter, Shyp and Spotify rely on CircleCI to accelerate delivery of their code and enable developers to focus on creating business value fast.</ul><p><b>What will make you successful:</b></p>\n\n<ul>\n<li>Comprehensive knowledge of the internal workings of at least one of Postgres, Mongo, Redis</li>\n<li>A collaborative approach to aiding software engineers in the development of fast and reliable data-driven applications</li>\n<li>Deep understanding of the tradeoffs in datastore selection and the implications for application design</li>\n<li>Passion for modern software development and operation, including agile, CI/CD, and infrastructure-as-code</li>\n<li>Experience managing large-scale database systems in a cloud environment</li>\n<li>Systematic problem solving approach, coupled with a strong sense of ownership and drive</li>\n<li>Proficiency in one or more of: C, C++, Java, Python, Go</li>\n<li>A strong desire for continuous improvement</li>\n<li>8+ years of experience</li>\n<ul>\n<b>What you will do:</b>\n<ul>\n<li>Design and deliver solutions to improve the availability, scalability, latency, and efficiency of CircleCI’s data storage layer</li>\n<li>Engage in datastore capacity planning and demand forecasting, anticipating performance bottlenecks</li>\n<li>Diagnose and resolve production issues in conjunction with software engineering teams</li>\n<li>Architect and implement tooling used by all services within the CircleCI platform, for both SaaS and on-prem configurations</li>\n<li>Support and advise software engineering teams in the design of scalable services</li>\n<li>Participate in rotating on-call duties, including incident management</li>\n<li>Define the requirements for a growing discipline of DBRE at CircleCI</li>\n</ul>\n<p>If you’re interested in joining the team at CircleCI, please send a resumé and let us know why you’d be a great fit for our team. If you contribute to an open source project, write a blog, or have a presence on the web (Twitter, GitHub, LinkedIn, etc.) we would love to hear about it.</p>\n\n<p>CircleCI is a Bay Area Best Places to Work 2016 award winner. Founded in 2011 and headquartered in beautiful downtown San Francisco with a global remote workforce, CircleCI is venture backed by Scale Venture Partners, DFJ, Baseline Ventures and Harrison Metal Capital.</p>\n\n<p>We care deeply about diversity and inclusivity. We’re hiring at all experience levels, and seek talented teammates from a wide variety of backgrounds and experiences who are equally committed to cultivating a work environment of respect and kindness. We carefully consider every applicant that takes the time to apply.</p>\n</ul>\n</ul>","how_to_apply":"<p><a href=\"https://jobs.lever.co/circleci/18707723-9314-47c0-8f21-65b13060f1af?leverorigin=applied&amp;lever-source%5B%5D=GITHUB\">https://jobs.lever.co/circleci/18707723-9314-47c0-8f21-65b13060f1af?leverorigin=applied&amp;lever-source%5B%5D=GITHUB</a></p>","company":"CircleCI","company_url":"http://www.circleci.com ","company_logo":null,"url":"http://jobs.github.com/positions/6b30596c-2332-11e8-8189-113b9f4337c4"},{"id":"91b351f8-22f0-11e8-9804-404a23a749b7","created_at":"Thu Mar 08 16:51:31 UTC 2018","title":"Frontend Developer - React Native","location":"Berlin","type":"Full Time","description":"<p>A healthier life is a happier life.</p>\n\n<p>Vivy elevates this vision into a new reality for everyone. With its holistic approach, the Vivy app empowers users and transforms them from being passive patients to proactive individuals who are in charge of their own health. Within a single, integrated application, Vivy is the one place for users to consolidate medical documents and health data, adhering to the highest standards of data protection and encryption technology. As the team behind Vivy, we are focused on creating real value that benefits our users’ lives by crafting user centric features. We are always looking for new members for our international team in Berlin-Mitte who are enthusiastic about disrupting the healthcare system.</p>\n\n<p>Are you ready to join the revolution?</p>\n\n<p>YOUR ROLE</p>\n\n<p>Shape and implement our web-based applications our partners use to access and interact with our platform Collaborate closely with our back-end engineers and product and design team to achieve results that work flawless and look and feel just amazing Make informed decisions on the front-end architecture and tooling based on experience and up-to-date knowledge of front-end technologies with user experience in mind. Help to Improve and further develop the current deployment pipeline (CD, Docker, A/B deployment) Maintain and improve the existing solutions</p>\n\n<p>YOUR PROFILE</p>\n\n<p>You are passionate about technologies and is always eager to learn You have solid experience in architecturing modern web applications using JavaScript, HTML, CSS and modern front-end technologies and tools like React, Redux, NodeJS, Webpack, Docker, etc. You have also a good understanding about back-end architectures and their respective whys You have a fluent command of English</p>\n\n<p>OUR OFFER</p>\n\n<p>High degree of autonomy and crucial role in a highly motivated, talented and international team A stack of the most modern technologies All the equipment you’ll need like a brand-new MacBook Pro, 27” 4k display, etc. An opportunity to shape a product that may enhance the life of millions of people Flat hierarchies, as well as short and open channels of communication</p>","how_to_apply":"<p>Please apply at jobs@vivy.com.\nWe are looking forward to receiving your application and will get in touch with you quickly.</p>","company":"Vivy","company_url":"http://www.vivy.com","company_logo":"http://github-jobs.s3.amazonaws.com/8935993c-22f0-11e8-95ac-12c98d7773c4.png","url":"http://jobs.github.com/positions/91b351f8-22f0-11e8-9804-404a23a749b7"},{"id":"47811294-22a7-11e8-8bd6-eee4c9926b43","created_at":"Thu Mar 08 08:04:52 UTC 2018","title":"Software Test Engineer","location":"Bucharest","type":"Full Time","description":"<p><strong>We’re Looking for Rockstars to Join Our Team!</strong></p>\n\n<p>At Suvoda, we’re not only passionate about the work that we do and the impact that it has on human lives, but we’re passionate about the people who make it happen! Every day, it is our priority to bring in talented and motivated individuals and create a workplace that drives, engages and retains them.</p>\n\n<p><strong>What Makes Suvoda a Great Place to Work?</strong></p>\n\n<p>Here are just a few highlights:</p>\n\n<ul>\n<li>Your colleagues: You’ll be surrounded by smart, friendly team players that truly care about the work they do, and there are plenty of happy hours and teambuilding events to connect outside work</li>\n<li>The flexibility: Suvoda creates the perfect environment for people to integrate their work and life, by offering flexible working hours and the tools to work from home as needed</li>\n<li>The growth and innovation: As part of a growing team, you’ll have lots of opportunities for career development and be exposed to the latest technologies due to our focus on remaining innovative</li>\n<li>The office: Our newly renovated, modern office space is located in the city center and is equipped with comfortable work spaces, collaborative gathering areas and modern technology that easily connects you to all of our global offices</li>\n<li>The benefits: You’ll have access to a robust benefits package, like free lunch at the office every day, a top subscription from Romania’s top healthcare provider, a fitness stipend, and competitive salaries with bonus plans</li>\n<li>The industry: By working in clinical trials, you’’ll be part of a challenging and rewarding industry that will allow you to develop your skills quickly while doing your part to change the world.</li>\n</ul><p><strong>What Should You Expect?</strong></p>\n\n<p>As a Software Test Engineer, you’ll be part of a six- to nine-person, cross-functional, international project team, working together to build web applications used by pharmaceutical and biotech clients during the clinical trial process.</p>\n\n<p><strong>Your role will include:</strong></p>\n\n<ul>\n<li>Working to deliver custom software solutions that streamline the clinical trial process for pharmaceutical and biotech clients.</li>\n<li>Ensuring the correct functioning of clinical trial software with focus on patient safety and integrity of clinical study data.</li>\n<li>Ensuring all activities and deliverables comply with FDA regulations.</li>\n<li>Verifying that system requirements are clear, testable, and consistent with the clinical trial protocol.</li>\n<li>Developing validation plans according to a risk-based testing methodology.</li>\n<li>Authoring and managing the completion of all validation related deliverables on each project: test summary report, etc.</li>\n<li>Authoring and executing test scripts.</li>\n<li>Documenting defects and tracking resolution.</li>\n<li>Performing other related duties as required.</li>\n</ul><p><strong>Essential requirements:</strong></p>\n\n<ul>\n<li>Bachelor's degree (in computer science preferred) or college degree in progress.</li>\n<li>1-3 years’ experience in software testing of Enterprise or Web applications.</li>\n<li>Experience with multiple testing methods such as: smoke tests, black-box, white-box, gray-box, boundary testing.</li>\n<li>Basic knowledge of RDBMS principles and SQL.</li>\n<li>Ability to learn technological applications, conduct in-depth investigative research, read and understand code, and determine and execute the best test methods for complex systems.</li>\n<li>Highly proficient in spoken and written English.</li>\n</ul><p><strong>Nice to have:</strong></p>\n\n<ul>\n<li>Advanced knowledge of RDBMS principles – complex queries, design for performance and efficiency, etc.;</li>\n<li>Familiarity with Agile software development philosophy, principles, and techniques;</li>\n<li>Familiarity with Automation tools and principles of Automation;</li>\n<li>Familiarity with Java or any scripting knowledge.</li>\n</ul><p><strong>Join us if you think we can accomplish great things together!</strong></p>","how_to_apply":"<p><a href=\"https://smartdreamers.ro/ro/job-software-test-engineer-suvoda/50677/\">https://smartdreamers.ro/ro/job-software-test-engineer-suvoda/50677/</a></p>","company":"SUVODA","company_url":"https://smartdreamers.ro/ro/company-suvoda/5173/","company_logo":"http://github-jobs.s3.amazonaws.com/22aabf24-22a7-11e8-897a-bac2786f6af4.jpg","url":"http://jobs.github.com/positions/47811294-22a7-11e8-8bd6-eee4c9926b43"},{"id":"a5ad0732-224e-11e8-9651-0d8b3631ae8a","created_at":"Wed Mar 07 21:30:27 UTC 2018","title":"Database Engineer / Optimization / Implementations","location":"Palo Alto","type":"Full Time","description":"<p>We are hiring for a part-time or full-time database engineer to join our Palo Alto team.</p>\n\n<p>Job description</p>\n\n<p>ClearAccessIP team is looking for a strong database engineer to join our team to enable us to grow our data-driven, high impact analytics and data management offering. If you are data curious, excited about deriving insights from data, and motivated by having impact on the business, we want to hear from you.</p>\n\n<p>As a database and dev ops engineer, you would be responsible for:</p>\n\n<ul>\n<li>Building, deploying and monitoring our environment servers</li>\n<li>Implementing and optimizing statistical and deep learning models on large datasets,</li>\n<li>Database maintenance and optimization</li>\n</ul><p>Required Qualifications</p>\n\n<ul>\n<li>Strong experience with one or more of the following technologies: Java, Python, Shell Scripting, PostgreSQL/MySQL, MongoDB</li>\n<li>Experience with web servers (Apache, Tomcat, etc)</li>\n<li>Experience with AWS services e.g., S3, EC2</li>\n</ul><p>Bonus!</p>\n\n<ul>\n<li>For the right candidate, be hire #10 and join our 2015 stock option plan after 90 days.</li>\n<li>we cover lunch every work day on the food-filled California Ave in Palo Alto.</li>\n<li>Technical advisors from the top professors in machine learning</li>\n<li>$2800 conference stipend</li>\n<li>the top healthcare California has to offer (UnitedHealth Gold Plus Plan)</li>\n<li>$250/month health and wellness stipend</li>\n<li>Reasonable work schedule for a start-up (our average engineer arrives to work at 10am)</li>\n<li>light-filled office surrounded by trees</li>\n</ul><p>We are hiring quickly, so be sure to reach out if you're interested!</p>","how_to_apply":"<p>Email resume and two references to: <a href=\"mailto:nicole@clearaccessip.com\">nicole@clearaccessip.com</a></p>","company":"ClearAccessIP","company_url":"http://Www.ClearAccessIP.com","company_logo":null,"url":"http://jobs.github.com/positions/a5ad0732-224e-11e8-9651-0d8b3631ae8a"},{"id":"86dd462c-2240-11e8-95a9-cd9df51db7fc","created_at":"Wed Mar 07 19:51:31 UTC 2018","title":"Systems Analyst/Programmer, Libraries Information Technology ","location":"New York, NY","type":"Full Time","description":"<p>Columbia University Libraries seeks a motivated and collaborative Systems Analyst/Programmer to join the Libraries Information Technology (LIT) division. \nUnder general supervision, develops specifications and requirements for database applications in support of library programs; programs, enhances, modifies, and expands new and existing database applications and related programs; installs and integrates vendor-supplied database applications. \nDetailed responsibilities include but are not limited to: </p>\n\n<ul>\n<li>programming, debugging, and documenting complex software applications, including batch interface properties for database applications.</li>\n<li>consulting with Libraries staff to develop application functional requirements, conducting data analyses and preparing specifications.</li>\n<li>preparing program design descriptions, models and prototypes, modifying specifications to improve design and functionality, in consultation with other technical staff.</li>\n<li>managing security policies, access permissions, and disaster recovery for mission-critical data on servers and desktop systems.</li>\n<li>installing and integrating vendor-supplied database applications.</li>\n<li>acting as a resource and consultant to staff involved in related projects and performing other duties as assigned.\nAs one of the world's leading research universities, Columbia University in the City of New York provides outstanding opportunities to work and grow in a dynamic multicultural intellectual community. The Columbia University Libraries comprises a diverse, collegial and engaged staff committed to furthering the University’s teaching and research mission through innovation, leadership, collaboration and professionalism.</li>\n</ul><p>Minimum Qualifications: </p>\n\n<ul>\n<li>Bachelor's degree and a minimum three years’ related experience or the equivalent combination of education and experience.</li>\n<li>Experience in progressive analysis and programming.</li>\n<li>Development experience in UNIX.</li>\n<li>Proficiency in one or more appropriate application development languages (such as perl, PHP, python, ruby). </li>\n<li>Development experience in MySQL, Oracle, and/or Microsoft SQL environments. </li>\n<li>Familiarity with the design and programming of relational database applications. </li>\n<li>Familiarity with MARC, JSON, XML</li>\n<li>Ability to perform systems analysis and programming independently, under general direction. </li>\n<li>Strong verbal and written communication skills. </li>\n<li>Must be able to balance priorities and meet deadlines on multiple tasks.</li>\n<li>Commitment to supporting and working in a diverse environment.\nPreferred Qualifications: </li>\n<li>Previous experience with automation applications in a library environment strongly preferred.</li>\n</ul><p>Submit an application on-line at <a href=\"https://jobs.columbia.edu/applicants/Central?quickFind=167631\">https://jobs.columbia.edu/applicants/Central?quickFind=167631</a></p>\n\n<p>Columbia University is an Equal Opportunity/Affirmative Action employer and strongly encourages individuals of all backgrounds and cultures to consider this position.</p>","how_to_apply":"<p>Submit an application on-line at <a href=\"https://jobs.columbia.edu/applicants/Central?quickFind=167631\">https://jobs.columbia.edu/applicants/Central?quickFind=167631</a></p>","company":"Columbia University","company_url":null,"company_logo":null,"url":"http://jobs.github.com/positions/86dd462c-2240-11e8-95a9-cd9df51db7fc"},{"id":"2b37598a-223f-11e8-9f23-22626a83af7b","created_at":"Wed Mar 07 19:39:44 UTC 2018","title":"Systems Engineer, Libraries Information Technology ","location":"New York, NY","type":"Full Time","description":"<p>Columbia University Libraries seeks a motivated and collaborative Systems Engineer to join the Unix Systems Group in the Libraries Information Technology (LIT) division. \nReporting to the Senior Systems Engineer, the Systems Engineer will design, develop and deploy Unix server and storage systems and perform maintenance and security updates as required. Additionally, the incumbent will document and provide support for a variety of innovative projects and services within the Libraries as well as collaborate on specialized projects with various departments across the organization as needed. \nDetailed responsibilities include but are not limited to: </p>\n\n<ul>\n<li>Designing, installing, documenting, monitoring, optimizing, and maintaining Linux (primarily CentOS) servers.</li>\n<li>Monitoring, troubleshooting, and documenting some Linux servers maintained by CUIT.</li>\n<li>Modifying, testing, implementing, troubleshooting, and documenting both vendor-supplied and in-house applications on servers.</li>\n<li>Managing security policies, access permissions and disaster recovery for mission-critical data on servers and desktop systems.</li>\n<li>Collaborating on projects and related activities with other units, Columbia University IT (CUIT), other schools and departments at Columbia, and outside institutions.</li>\n<li>Performing other duties as assigned.</li>\n</ul><p>As one of the world's leading research universities, Columbia University in the City of New York provides outstanding opportunities to work and grow in a dynamic multicultural intellectual community. The Columbia University Libraries comprises a diverse, collegial and engaged staff committed to furthering the University’s teaching and research mission through innovation, leadership, collaboration and professionalism.</p>\n\n<p>Minimum Qualifications: </p>\n\n<ul>\n<li>Bachelor's degree and a minimum three years’ related experience or the equivalent combination of education and experience.</li>\n<li>Knowledge of Unix/Linux environment. </li>\n<li>Strong verbal and written communication skills. </li>\n<li>Knowledge of programming principles and at least one higher-level programming language. </li>\n<li>Must be able to balance priorities and meet deadlines on multiple tasks.</li>\n<li>Commitment to supporting and working in a diverse environment.\nPreferred Qualifications: </li>\n<li>Experience with CentOS, cloud services (AWS), virtualization (xen, vmware), configuration management (Saltstack, Ansible), Python, relational databases, storage management, source control (git), web services (nginx/apache, haproxy, varnish).</li>\n</ul><p>Submit an application on-line at <a href=\"https://jobs.columbia.edu/applicants/Central?quickFind=167618\">https://jobs.columbia.edu/applicants/Central?quickFind=167618</a></p>\n\n<p>Columbia University is an Equal Opportunity/Affirmative Action employer and strongly encourages individuals of all backgrounds and cultures to consider this position.</p>","how_to_apply":"<p>Submit an application on-line at <a href=\"https://jobs.columbia.edu/applicants/Central?quickFind=167618\">https://jobs.columbia.edu/applicants/Central?quickFind=167618</a></p>","company":"Columbia University","company_url":null,"company_logo":null,"url":"http://jobs.github.com/positions/2b37598a-223f-11e8-9f23-22626a83af7b"},{"id":"dbfc02f2-fd77-11e3-9627-a101934ea25e","created_at":"Wed Mar 07 16:13:10 UTC 2018","title":"Senior Web Applications Engineer (Rails+)","location":"San Francisco","type":"Full Time","description":"<p>As a Senior full-stack engineer at Sharethrough you’ll build out our native monetization software suite used by top publishers to connect with brands on the open web, powering critical revenue behind companies like Disney, CNN, VICE, and CBSi.  We believe that advertising can be better and you'll help make that happen.  You'll be a key contributor to our Rails-based server side platform and multiple backend integrations that interface with systems varying from ad serving to data warehousing.</p>\n\n<p><strong>What You'll Be Doing</strong></p>\n\n<ul>\n<li>\n<strong>Having a say:</strong> You’ll participate in the problem definition and solution process with a diverse group of engineers, designers and business owners from around the company.</li>\n<li>\n<strong>Proper engineering:</strong> Writing Rails and JS that is performant, well-tested, and easy to maintain.</li>\n<li>\n<strong>Technical heavy lifting:</strong> You’ll architect and implement major components of an ambitious technical roadmap.</li>\n<li>\n<strong>Deploying code on your first day:</strong> We push to production on every commit via our continuous integration and deployment pipeline.</li>\n</ul><p><strong>Let's Talk If</strong></p>\n\n<ul>\n<li>\n<strong>You’ve shipped software:</strong> You have production experience with a nice bit of our stack: Ruby, Rails, Sidekiq, React, Node.js, etc. and for the parts you don’t, you’re excited to learn.</li>\n<li>\n<strong>You care about code:</strong> You take pride in development, and have a deep understanding of how to write high quality, maintainable, extensible software.</li>\n<li>\n<strong>You want to derive meaning from what you do:</strong> Every engineer here is excited to understand what problem they’re solving, why they’re solving it and who they’re solving it for.</li>\n</ul><p><strong>Why You'll Love Working at Sharethrough</strong></p>\n\n<ul>\n<li>\n<strong>Values-driven culture:</strong> You’d be walking into a welcoming and diverse environment that is built around action, optimism, purpose and transparency.  We have a fun, supportive culture, and firmly believe in what we’re doing.</li>\n<li>\n<strong>Marry the problem, not the solution:</strong> We’re constantly re-evaluating our technical infrastructure to deliver faster, better, and more reliable software.</li>\n<li>\n<strong>Twenty percent time:</strong> One day a week you’ll have the opportunity to dig deeper and explore new technologies, frameworks, etc. This is time set aside for you and the team as an investment in you, and you’ll have the chance to exchange learnings with your team.</li>\n</ul>","how_to_apply":"<p><a href=\"https://jobs.lever.co/sharethrough/bf13c994-3a3f-4981-af51-45961497af30/apply?lever-source=Github\">https://jobs.lever.co/sharethrough/bf13c994-3a3f-4981-af51-45961497af30/apply?lever-source=Github</a></p>","company":"Sharethrough","company_url":"http://Sharethrough","company_logo":"http://github-jobs.s3.amazonaws.com/e0508206-6bc1-11e5-89ca-4c0b59d838c7.png","url":"http://jobs.github.com/positions/dbfc02f2-fd77-11e3-9627-a101934ea25e"},{"id":"01e73658-2222-11e8-9d65-a99426a7533d","created_at":"Wed Mar 07 16:10:28 UTC 2018","title":"Software Engineer - Fullstack","location":"Bengaluru, India","type":"Full Time","description":"<p>Company Description</p>\n\n<p>Vlocity is a fast-growing enterprise applications company focused on bringing industry-specific business processes to the cloud. With 300 employees around the world and customers on six continents, Vlocity has been the fastest-growing independent software vendor on the Salesforce platform for two years running. Vlocity is currently shipping version 15 of its application suite, and has raised over $100MM in capital from investors including Salesforce.com, Accenture and Sutter Hill Ventures.</p>\n\n<p>Vlocity develops software to help communications, media &amp; energy providers, insurance carriers and government agencies digitally engage customers through their channels and devices of choice. We serve dozens of the world’s Fortune 5000 companies including Sky Italia, Telecom Italia, TELUS, 3, Telecom Argentina, Cellcom, New York Life, Farmers Insurance, Harvard Pilgrim, and Anthem. Our solutions run on our customers’ web sites, in their contact centers and on the mobile devices of their service and sales professionals – providing a compelling, modern, omnichannel experience. Despite the complexity and sophistication of the enterprise business processes we enable, we believe the user experience should be as simple and compelling as a consumer application.</p>\n\n<p>Job Description</p>\n\n<p>Vlocity, Inc. is recruiting full stack application developers to join our fast growing startup. These\ndevelopers will have the unique opportunity to shape and create Vlocity's vertical apps from the ground\nup built on the Salesforce Platform.</p>\n\n<p>As an early developer, you will be responsible for designing and implementing product requirements that are highly usable, scalable, extensible, and maintainable, in large part on the Force.com platform. You will work in a highly agile environment, with product managers, engineers and customers, as well as with our leadership team, using iterative and test-driven design methods. You will be developing modern, web-based applications for the Salesforce1 Platform using Visualforce, Apex, Javascript, HTML/CSS, and other technologies. An understanding of relational &amp; NoSql databases is a plus.</p>\n\n<p>We are going to build our industry apps on modern technology stacks. Force.com and Salesforce1 will be our cloud-based CRM platform. We will add additional technology stacks as needed and you'll be part of that analysis and development process.</p>\n\n<p>Responsibilities</p>\n\n<p>● Design and develop products in Visualforce, Apex, SalesForce1, Javascript, HTML/CSS, and\nrelated technologies.</p>\n\n<p>● Object and entity modelling on Force.com platform.</p>\n\n<p>● Write create clean, effective code for simple or complex user tasks.</p>\n\n<p>● Work in an agile, rapid development and prototyping environment where effective communication\nis paramount.</p>\n\n<p>● Contribute to building a positive, can-do, high-performance culture.</p>\n\n<p>Experience</p>\n\n<p>● 3+ years of product development experience.</p>\n\n<p>● Experience with the Spring framework, JDBC, Maven and other Java related technologies.</p>\n\n<p>● Excellent understanding of object-oriented design patterns &amp; experience with OO languages\n(Java, Ruby, Python, Scala etc).</p>\n\n<p>● Excellent Data Structure and Algorithms experience.</p>\n\n<p>● Experience building web-based user interfaces, with a deep understanding of HTML, Javascript,\nand CSS.</p>\n\n<p>● Experience with and knowledge of relational databases.</p>\n\n<p>● Familiarity with JavaScript libraries such as jQuery, AngularJS, Backbone.</p>\n\n<p>● Experience and desire to work within a fast-paced, iterative development environment;</p>\n\n<p>● Experience with Agile development is a strong plus.</p>\n\n<p>● Experience with Force.com and the SalesForce1 platform is a plus.</p>\n\n<p>● Stellar academic background, Bachelor degree or equivalent experience required, specializing in\ncomputer science or similar engineering discipline.</p>","how_to_apply":"<p>Apply directly through our jobs page at: <a href=\"https://grnh.se/cijut1me1\">https://grnh.se/cijut1me1</a></p>","company":"Vlocity","company_url":"https://www.vlocity.com","company_logo":"http://github-jobs.s3.amazonaws.com/fc87ecf2-2221-11e8-853f-63848354227a.jpg","url":"http://jobs.github.com/positions/01e73658-2222-11e8-9d65-a99426a7533d"},{"id":"5c66b6fc-221e-11e8-81c4-db18d71eff9b","created_at":"Wed Mar 07 15:54:25 UTC 2018","title":"Senior Software Engineer - Python","location":"London","type":"Full Time","description":"<p>We are looking for a highly experienced Senior Software Engineer with strong commercial experience of Python to build and maintain our core Python based platforms and services, in particular, Pole Star's market-leading Fin Tech/Reg Tech products. You'll work in a talented and interdisciplinary team, with a strong creative culture, and help us deliver high impact work. </p>\n\n<p>Would you like to work for an established, fun and interesting Company? </p>\n\n<p>We provide tracking and monitoring services to the global maritime industry from our headquarters in London, with other offices in the maritime hubs of Boston, Panama, Hong Kong, Singapore and Australia.\nWe run provide and manage data centres for 46 governments worldwide, we monitor 40,000 ships on behalf of 1,300 clients located in over 90 countries.\nPole Star continues to experience strong growth and sustained profitability. The company is among Britain’s fastest-growing private technology companies and was ranked in The Sunday Times Tech Track 100 league table. We are a privately owned UK Company and have a multinational team of 100 people, fluent in over 24 languages.</p>\n\n<p>Would you like to:</p>\n\n<ul>\n<li>       Identify production and non-production application issues.</li>\n<li>       Identify opportunities to fine-tune and optimize applications of projects both existing and   upcoming.</li>\n<li>       Provide direct support to the Head of Software development’s efforts, as and when requested</li>\n<li>       Develop, test, implement and maintain application software working with established processes and procedures.</li>\n<li>       Support formal testing and resolve test defects.</li>\n<li>       Create services and applications utilizing various programming languages.</li>\n</ul><p>Skills &amp; requirements\nYour essential skills and experience:</p>\n\n<ul>\n<li>       Commercial experience working in a fast-paced, Agile (Scrum or similar) software</li>\n<li>       development environment</li>\n<li>       Four or more years of solid commercial Python experience</li>\n<li>       JSON, REST, SOAP and RESTful Services and API’s</li>\n<li>       Database and SQL knowledge, PostgreSQL, Oracle, PostGIS,</li>\n<li>       Solid commercial Linux/Unix knowledge (Redhat/CentOS/Fedora)</li>\n<li>       Jenkins, CI integration</li>\n<li>       SQS, RabbitMQ, Redis experience</li>\n<li>       Experience in migrating/updating legacy systems (e.g. Python 2.x to 3)</li>\n<li>       A strong drive and interest to learn new technologies quickly</li>\n<li>       Bachelor’s or Master’s degree in Computer Science, Engineering, or related field</li>\n</ul><p>It would be ideal if you also had experience in: </p>\n\n<ul>\n<li>       Web development: HTML (HTML5 &amp; CSS) and XML/XSL</li>\n<li>       JIRA., other Atlassian products</li>\n<li>       Knowledge of Geo-Spatial technology or GeoServer</li>\n<li>       AWS, AWS RDS</li>\n<li>       Docker</li>\n</ul><p>Company Perks and Benefits:</p>\n\n<ul>\n<li>      Competitive Salary of £65000 per annum</li>\n<li>      Visa sponsorship</li>\n<li>      3x salary life assurance cover</li>\n<li>      25 days annual leave + UK public holidays</li>\n<li>      5% Contributory pension scheme</li>\n<li>      Active professional development and opportunities to attend conferences here and abroad</li>\n<li>      Private Health Insurance</li>\n<li>      Dental Insurance</li>\n<li>      Refer a friend recruitment bonus scheme</li>\n<li>      Business expenses</li>\n<li>      Annual Season Ticket Loan for your commute</li>\n<li>      Subsidised Gym Membership</li>\n<li>      Childcare Vouchers</li>\n<li>      Daily fruit baskets and cold pressed juices</li>\n<li>      On-site yoga classes and 5-aside football</li>\n<li>      Annual health-checks<br>\n</li>\n<li>      Exclusive staff discount on shopping &amp; dining at Westfield, London W12</li>\n<li>      Discount online benefit portal, offering a wide range of discounts for high street retailers</li>\n<li>      Ability to buy and sell holidays</li>\n</ul>","how_to_apply":"<p>To apply, please, send your CV to <a href=\"mailto:recruitment@polestarglobal.com\">recruitment@polestarglobal.com</a>.</p>\n\n<p>Thank you.</p>","company":"Pole Star Space Applications","company_url":"https://www.polestarglobal.com/","company_logo":"http://github-jobs.s3.amazonaws.com/4388c24c-221e-11e8-8d92-574c93808f15.jpg","url":"http://jobs.github.com/positions/5c66b6fc-221e-11e8-81c4-db18d71eff9b"},{"id":"d309d880-221d-11e8-9764-1d0ddc271618","created_at":"Wed Mar 07 15:40:57 UTC 2018","title":"Software Engineer","location":"San Francisco, CA","type":"Full Time","description":"<p>Company Description</p>\n\n<p>Vlocity is a fast-growing enterprise applications company focused on bringing industry-specific business processes to the cloud. With 300 employees around the world and customers on six continents, Vlocity has been the fastest-growing independent software vendor on the Salesforce platform for two years running. Vlocity is currently shipping version 15 of its application suite, and has raised over $100MM in capital from investors including Salesforce.com, Accenture and Sutter Hill Ventures.</p>\n\n<p>Vlocity develops software to help communications, media &amp; energy providers, insurance carriers and government agencies digitally engage customers through their channels and devices of choice. We serve dozens of the world’s Fortune 5000 companies including Sky Italia, Telecom Italia, TELUS, 3, Telecom Argentina, Cellcom, New York Life, Farmers Insurance, Harvard Pilgrim, and Anthem. Our solutions run on our customers’ web sites, in their contact centers and on the mobile devices of their service and sales professionals – providing a compelling, modern, omnichannel experience. Despite the complexity and sophistication of the enterprise business processes we enable, we believe the user experience should be as simple and compelling as a consumer application.</p>\n\n<p>Job Description</p>\n\n<p>Vlocity, Inc. is recruiting full stack application developers to join our fast growing team.</p>\n\n<p>You will be responsible for designing and implementing product requirements that are highly usable, scalable, extensible, and maintainable, in large part on the Salesforce platform. You will work in a highly agile environment, with product managers, engineers and customers, as well as with our leadership team, using iterative and test-driven design methods.</p>\n\n<p>You will be developing modern, web-based applications for the Salesforce Platform using Apex, Javascript, HTML/CSS, and other technologies. An understanding of relational databases is a plus.</p>\n\n<p>Responsibilities</p>\n\n<ul>\n<li><p>Stellar academic background, Bachelor degree or equivalent experience required, specializing in computer science or similar engineering discipline.</p></li>\n<li><p>Excellent understanding of data structures, object-oriented design patterns &amp; experience with OO languages like Java.</p></li>\n<li><p>Experience with and knowledge of relational databases.</p></li>\n<li><p>Experience with Force.com and the Salesforce platform is a plus.</p></li>\n<li><p>Experience and desire to work within a fast-paced, iterative development environment; experience with Agile development is a strong plus.</p></li>\n</ul><p>Experience</p>\n\n<ul>\n<li><p>Minimum 2 years experience developing software in a product environment. </p></li>\n<li><p>Experience with Force.com and the SalesForce1 platform is a plus.</p></li>\n<li><p>Experience building web-based user interfaces, with a deep understanding of HTML, Javascript, and CSS.</p></li>\n<li><p>Experience with and knowledge of relational databases.</p></li>\n<li><p>Experience and desire to work within a fast-paced, iterative development environment</p></li>\n<li><p>Experience with Agile development is a strong plus.</p></li>\n</ul><p>Technical Skills</p>\n\n<ul>\n<li><p>Excellent understanding of Object-Oriented Programming patterns &amp; experience with OO languages (Java, Ruby, Python, Scala etc) </p></li>\n<li><p>Familiarity with JavaScript libraries such as jQuery, AngularJS, Backbone  </p></li>\n<li><p>Desired Certifications / Qualifications</p></li>\n<li><p>Stellar academic background</p></li>\n<li><p>Bachelor degree in computer science or similar engineering discipline </p></li>\n</ul>","how_to_apply":"<p>Apply directly through our jobs page at: <a href=\"https://grnh.se/vfby440u1\">https://grnh.se/vfby440u1</a></p>","company":"Vlocity","company_url":"https://www.vlocity.com","company_logo":"http://github-jobs.s3.amazonaws.com/be1eef3c-221d-11e8-986d-6b78ac3ca414.jpg","url":"http://jobs.github.com/positions/d309d880-221d-11e8-9764-1d0ddc271618"},{"id":"10319492-2218-11e8-9a54-4736562032b8","created_at":"Wed Mar 07 15:01:05 UTC 2018","title":"TECHNICAL PRODUCT LEAD","location":"Remote","type":"Full Time","description":"<p><strong>DESCRIPTION:</strong>\nClevertech is looking for a Tech Lead to join our worldwide team. Clevertech looks for craftsmen developers who take ownership of their code. You can deliver quickly while being clever to avoid missteps.</p>\n\n<p>You have an effective positive attitude that shines as you show your care about the client’s concerns as well as a colleague’s concerns. You are always learning and are a transparent communicator even when it is challenging.</p>\n\n<p>Our technical product leaders spend much of their time in the code. Develop world class software products for the most exclusive companies in the world. 75% of your time leading the technical strategy in the code; 25% of your time in meetings organizing and unlocking the other devs</p>\n\n<p>You set the mood on the team. Not only internally but also with our clients. You get excited about getting the best out of team member and have demonstrated successful product launches.</p>\n\n<p><strong>REQUIREMENTS:</strong></p>\n\n<ul>\n<li><p>7+ years of experience in software development teams. New tools are great, but fundamentals of data structures, design patterns, and programming practices are what deliver projects.</p></li>\n<li><p>Has led a product meeting that has technical implications with Fortune 500 executives sitting around a conference room table</p></li>\n<li><p>Deep knowledge of Javascript and language agnostic as we utilize other technologies such as Python, Clojure, Go, C# and on occasion Java or C++ .</p></li>\n<li><p>Well qualified applicants will have deep experiences in the latest libraries and programming techniques. You have accomplishments that showcase your capabilities.</p></li>\n<li><p>Excellent self-starter who collaborates effectively with all stakeholders, and has the ability to work in a fast-paced team.</p></li>\n</ul><p><strong>BENEFITS:</strong></p>\n\n<p><em>Own Your Time</em>\nWe are a completely remote team. That means we have a large amount of trust and a lot of flexibility. World travellers, young parents, nature lovers, and commute avoiders love working here. We also will pay for a co-working space in case you feel like working outside of your normal setting.</p>\n\n<p><em>Recharge Time</em>\nWe insist that you take recharge time. We are closed for major holidays and then require that you take at least two weeks a year to refresh.</p>\n\n<p><em>Care For Yourself</em>\nYou’ll receive a health/wellness stipend that can go towards covering medical insurance, dental insurance, or joining a gym!</p>\n\n<p><em>Focused Work</em>\nYou will work together on a dedicated team with your eye on one finish line at a time. Our teams are nimble and agile, and cover the technical range you would expect in world class product delivery teams.</p>\n\n<p><em>Learn at your Edges</em>\nWe believe in learning and provide unique programs that improve your tech skills, leadership skills and even challenge you in personal development. CleverFridays, guest speakers, mentorship opportunities and in-depth industry exposure are all on offer here. And of course, if you speak at a tech conference, we cover all expenses.</p>\n\n<p><em>Clevertech Swag</em>\nAnd keep your eye on the mail - we send out swag everywhere in the world and there are celebratory pictures of Clevertech socks, hoodies, and mugs all over slack.</p>\n\n<p>Want to learn more about Clevertech and the team? Check out <a href=\"https://youtu.be/KwOz-y4uuWk\">https://youtu.be/KwOz-y4uuWk</a></p>","how_to_apply":"<p><a href=\"https://hire.clevertech.biz/job/587cf23957e2b97032a5528d?src=Github\">https://hire.clevertech.biz/job/587cf23957e2b97032a5528d?src=Github</a></p>","company":"Clevertech","company_url":"https://clevertech.biz/","company_logo":null,"url":"http://jobs.github.com/positions/10319492-2218-11e8-9a54-4736562032b8"},{"id":"d9983c7c-3999-11e7-8222-72f96992a639","created_at":"Wed Mar 07 08:34:11 UTC 2018","title":"Senior Product Engineer - Ruby + JavaScript ","location":"Amsterdam/Remote","type":"Full Time","description":"<p>Senior Product Engineer (full-time+remote).</p>\n\n<p>Deliver value every day and have an impact on the world!</p>\n\n<p>Our mission is simple: we want to revolutionize digital catalogs. That’s why we’re dedicated to building a beautiful web app with meticulous attention to quality. Working from our office in Amsterdam, we use many technologies (JS (Node, React, Backbone, Redux), Ruby (RoR)) to change the catalog forever. We believe in getting things done, making decisions fast, and not wasting time in endless meetings. We do this by listening to our customers, checking the data, and trusting our gut.</p>\n\n<p>Everyone in our development team works together and contributes to the success of our product, including UX designer and product manager. The engineer that we’re looking for is pragmatic, loves to get things done and has a strong focus on results. We promise to get rid of everything that stands in your way so you can create your best work. If this sounds like your kind of place, it’s time to get in touch.</p>\n\n<p>Responsibilities:</p>\n\n<ul>\n<li>Performance, stability and scalability of our stack</li>\n<li>Product development</li>\n<li>Contributing to our development, product and design strategy</li>\n</ul><p>Skills:</p>\n\n<ul>\n<li>Proactively solving challenges</li>\n<li>Delivering features end to end</li>\n<li>Designing and implementing back-end and front-end architecture</li>\n<li>Deployment architecture and distributed job processing</li>\n<li>Single page JavaScript apps</li>\n<li>Cross-browser compatibility</li>\n<li>Mobile browser performance</li>\n<li>Writing specs/tests</li>\n<li>Ruby on Rails</li>\n<li>React + Redux</li>\n<li>Node.js</li>\n<li>AWS</li>\n<li>Modern JS (ES2015+)</li>\n<li>CoffeeScript</li>\n<li>Backbone.js</li>\n<li>PostgreSQL</li>\n<li>English</li>\n</ul><p>What can you expect from us?</p>\n\n<ul>\n<li>€39.6k-€55.2k gross salary per year.</li>\n<li>8% yearly holiday bonus paid every May</li>\n<li>25 paid vacation days</li>\n<li>A contract of indefinite duration</li>\n<li>Option to work remotely</li>\n<li>Free organic lunch</li>\n<li>We'll cover your travel expenses</li>\n<li>Unlimited budget for the Kindle Store and Apple App Store</li>\n<li>A remarkable company culture</li>\n<li>4 team retreats per year - check our last one <a href=\"https://youtu.be/LSzyVIhMJF8\">https://youtu.be/LSzyVIhMJF8</a>\n</li>\n<li>A great working environment in the center of Amsterdam</li>\n<li>We will challenge and support you to get the most out of your potential</li>\n<li>Equity plan (to be launched soon)</li>\n<li>30% tax ruling (for candidates outside of the NL)</li>\n<li>Visa sponsorship possibilities for candidates outside of the EU</li>\n</ul>","how_to_apply":"<p><a href=\"http://jobs.publitas.com/o/senior-product-engineer/c/new\">http://jobs.publitas.com/o/senior-product-engineer/c/new</a></p>","company":"Publitas","company_url":"https://www.publitas.com/about-us/","company_logo":"http://github-jobs.s3.amazonaws.com/c904fdf0-3999-11e7-9154-369f282201cb.png","url":"http://jobs.github.com/positions/d9983c7c-3999-11e7-8222-72f96992a639"},{"id":"0a5c9c78-2183-11e8-876a-40ccbde1ead0","created_at":"Tue Mar 06 21:13:04 UTC 2018","title":"Senior Software Architect","location":"Venice, CA","type":"Full Time","description":"<p>About Bites:</p>\n\n<p>Bites is an education technology company focused on personalized learning both within the news and traditional classroom instructional cycle. Through its two product offerings, Bites Media and Bites Labs, the company seeks to penetrate with offerings that complement each other from initial development to market offering.</p>\n\n<p>Bites is searching far and wide for an awesome Lead Software Engineer! Based in Venice, Bites is a seed funded startup that focuses on personalized learning platforms — transforming the way teachers engage and support their students. You will be building out the architecture for our product offerings and helping to build a scalable team.</p>\n\n<p>If that sounds like you, we'd love to talk to you!</p>\n\n<p>Responsibilities:\nDesign and code innovative, scalable and robust features on both the backend and the web application layers.\nParticipate in all aspects of the project lifecycle, from ideation to specification to release.\nCollaborate closely with small, nimble, cross-functional teams, product managers and designers.</p>\n\n<p>Requirements:\nA Bachelor’s degree in Computer Science or related degree.\n4+ years hands on experience in full-stack software development and architecture. Prior management/mentorship experience.\nSignificant experience with at least one of the following programming languages: Python, Ruby, C#, PHP or Javascript.\nStrong experience designing and working with relational databases (/MySQL/MSSQL).\nProficient front-end web development skills -- HTML/CSS/JS.\nStrong experience building high scale and high performance applications.\nDevOps experience building reliable applications through automated testing, continuous integration, monitoring, and analytics.\nA solid grounding in Computer Science fundamentals, data structures, algorithms, and deftness at object-oriented design and systems architecture.</p>\n\n<p>Leadership skills:\nHave an ownership mentality.\nExperienced as technical lead on a project.\nDemonstrated experience mentoring other engineers.\nProvide full-stack expertise to the engineering team.\nPassionate about best practices on code quality and performance.\nAbility to effectively communicate with technical and non-technical teams.\nAbility to measure the risk of choosing a new technology from the point of view of delivering the product on time and training the team.\nStrong work ethics and leads by example.\nIt bothers you if your software is buggy and doesn't perform optimally.</p>\n\n<p>Bonus Points:\nExperience with CSS Preprocessors (Sass or Less)\nExperience with React, Backbone or any other JavaScript frameworks a major plus.\nExperience giving technical mentorship and best practices training to peers.\nDeep understanding of Agile software development lifecycle.\nInterest and/or love of K-12 education.</p>","how_to_apply":"<p>To apply please send resumes and introduction to <a href=\"mailto:nick@bitesmedia.com\">nick@bitesmedia.com</a> and cc <a href=\"mailto:benshahbaz@gmail.com\">benshahbaz@gmail.com</a>.</p>\n\n<p>Thank you.</p>","company":"Bites Media","company_url":"http://bitesmedia.com","company_logo":null,"url":"http://jobs.github.com/positions/0a5c9c78-2183-11e8-876a-40ccbde1ead0"},{"id":"dd29b0b2-214e-11e8-8097-282ce97b1636","created_at":"Tue Mar 06 14:59:30 UTC 2018","title":"Researcher - Machine Learning","location":"Nieuwegein (The Netherlands)","type":"Full Time","description":"<p>The Diagnostics &amp; Prognostics team within the SKF Research &amp; Technology Development group is responsible for generating new knowledge and technology in the field of bearing and machine monitoring. The deliverables of this team are directly supporting SKF’s journey through digital transformation and will change the way we do business. By obtaining and interpreting measurement data from bearings in the field, SKF strives for a paradigm shift from unplanned to scheduled maintenance. This enables SKF to move away from classical transactional business models to performance based service contracts.<br><br>\nTo strengthen our team in <strong>Nieuwegein </strong>we are looking for a:<br><br><strong>Researcher - Machine Learning</strong><br><br><strong>Job description</strong><br>\nIn this role, you will be working in multiple R&amp;D projects. In accordance with project needs, your main responsibilities will be (but are not limited to):</p>\n\n<ul>\n<li>Data wrangling: data transformation, feature extraction, principal component analysis and clustering</li>\n    <li>Using pattern recognition in time series (e.g. vibration, temperature) to detect anomalies</li>\n    <li>Develop technology and algorithms to make a prognosis of the remaining life of a mechanical system in operation</li>\n    <li>Develop machine learning algorithms using supervised and unsupervised learning</li>\n    <li>Collaborate with researchers in other areas such as tribology to combine physical modelling and data driven approaches (hybrid modelling)</li>\n    <li>Use automation tools for optimization of machine learning algorithms and model validation</li>\n</ul><p><br><strong>Job requirements</strong></p>\n\n<ul>\n<li>\n<strong>Masters </strong>or <strong>PhD degree </strong>in <strong>mathematics</strong>, <strong>statistics</strong>, <strong>computer science </strong>or related discipline</li>\n    <li>\n<strong>Proven record </strong>in <strong>researching </strong>and <strong>applying machine learning techniques</strong> (e.g. speech recognition, image recognition and classification)</li>\n    <li>Affinity with mechanical systems and signal processing</li>\n    <li>\n<strong>Skilled in Matlab </strong>is <strong>required</strong>, preferred would be a second programming language, like C++, Python or R</li>\n    <li>Self-driven professional and team player</li>\n    <li>Good command of <strong>English</strong>\n</li>\n</ul><p><br><strong>Our offer</strong><br>\nWe offer you the opportunity to work in an innovative and well-equipped R&amp;D environment, which is part of a large, successful company with an excellent reputation. You will join a team of well-motivated colleagues and will have a lot of international contacts. We look forward to see you develop as a professional who creates a career in SKF and we will support your steps. Of course, our employment conditions are competitive.<br><br><strong>About SKF</strong><br>\nSKF works to reduce friction, make things run faster, longer, cleaner and more safely. Doing this in the most effective, productive and sustainable way has made the SKF Group a leading global supplier of products, solutions and services within rolling bearings, seals, mechatronics, services and lubrication systems. Services include technical support, maintenance services, condition monitoring, asset efficiency optimization, engineering consultancy and training. Check out <a href=\"https://ltpx.nl/2s1z6Bv\" target=\"_blank\"><strong><a href=\"http://www.skf.com\">www.skf.com</a></strong></a> for more information about our organization.<br><br>\nIf you have any questions regarding this job posting, please contact Mr. André van IJzendoorn, tel: +31(0)30 6075835, e-mail: <a href=\"mailto:andre.van.ijzendoorn@skf.com\"><strong><a href=\"mailto:andre.van.ijzendoorn@skf.com\">andre.van.ijzendoorn@skf.com</a></strong></a><br><br><em>Acquisition is not appreciated</em>.<img alt=\"\" src=\"https://bcontrol.brockmeyer.nl/track.php?orderid=42013\"></p>","how_to_apply":"<p><strong>Interested?</strong><br>\nIf you are interested and meet the requirements, please apply with your CV and motivation letter by using the <a href=\"https://ltpx.nl/4YyJVnf\" target=\"_blank\"><strong>online application form</strong></a>.<br><br></p>","company":"SKF B.V.","company_url":"http://www.skf.com/benelux/nl/our-company/index.html","company_logo":"http://github-jobs.s3.amazonaws.com/c2505822-214e-11e8-8522-6dcf8a2d19b2.JPG","url":"http://jobs.github.com/positions/dd29b0b2-214e-11e8-8097-282ce97b1636"},{"id":"58e8dfac-213b-11e8-843b-53b53b103189","created_at":"Tue Mar 06 12:39:48 UTC 2018","title":"Senior Javascript Developer - Remote","location":"Remote","type":"Full Time","description":"<p>The team at Kodify is looking for a talented Javascript Developer to join our remote team. This specific role is open to remote candidates based in European Union only (a must for us). With you on board, we’re looking to expand our team (currently 10 developers working across multiple European locations) and take our projects to a whole new level. Ability to work with our stakeholders to implement the features required.</p>\n\n<p>This role is specifically looking for people with skills within the field of BILLING and PAYMENTS, and as such, experience with 3rd party suppliers, databases, security (both network and data) are a significant requirement. The role will be to build and maintain a billing microservice, that allows our customers to confidently pay for our services, and allows us to manage our customer billing with ease.</p>\n\n<p><strong>KEY RESPONSIBILITIES</strong></p>\n\n<ul>\n<li>Be up to date with current billing solutions and practices</li>\n<li>Create Server side JS required functionality for billing systems</li>\n<li>Responsible for the security of the billing system</li>\n<li>Ensure all code is modular, and where possible developed as reusable</li>\n<li>End-to-end responsibility from technical design to deployment and testing</li>\n<li>Work with stakeholders to ensure they understand possibilities / limitations</li>\n<li>Always work towards making the system as fast as possible</li>\n<li>Become a valued team member, providing feedback to the team</li>\n<li>Take ownership of your code / tasks / role</li>\n<li>Be proud of what you achieve, and of the product, and be one of the driving forces behind always making it better</li>\n<li>When you screw-up - own-up! (We don’t do blame-storming here!)</li>\n<li>Have fun and enjoy your job!</li>\n</ul><p><strong>ABOUT YOU</strong></p>\n\n<ul>\n<li>You’ll be detail focused, and always want to ensure data is handled securely.</li>\n<li>An analytical mind is a must, especially when it comes to dissecting data.</li>\n<li>You’re a real team player. You love to help and find solutions together.</li>\n<li>Your sense of humour will bring a new dynamic to the team - you love to have fun while you work!</li>\n<li>You can think on your feet and adapt well to fast changing environments and priorities.</li>\n<li>You are passionate about software development</li>\n<li>You're able to think beyond code to architecture and user experience</li>\n<li>You have a real ‘Can Do’ work ethic - We are results based, not clock based</li>\n</ul><p><strong>REQUIREMENTS</strong></p>\n\n<ul>\n<li>Expert in understanding and developing billing solutions</li>\n<li>Great Javascript skills</li>\n<li>NodeJS</li>\n<li>MongoDB</li>\n<li>Github</li>\n<li>Security</li>\n</ul><p><strong>Bonus points:</strong>\nRecent experience with Rocketgate or other billing gateway\nRedis\nMessage Queuing systems\nReact\nHTML / CSS\nTDD\nYour own open source projects\nHigh traffic websites\nLinux\nAWS Technologies (e.g. EC2, S3, Cloudformation, ..)\nUnderstanding of, and agreement with, Agile principles\nKnowledge and experience in Git and JIRA</p>\n\n<p><strong>Other:</strong>\nExperience working remotely and with remote teams\nExperience managing high traffic and content heavy websites.</p>\n\n<p><strong>EDUCATION</strong></p>\n\n<p>Education is compulsory, but where you got it is irrelevant for us! We are looking for someone who has worked in a similar role (or roles) for at least 3 years, and can show us examples of their work. We are not looking for a newbie, nor are we looking for a rockstar, we are looking for a mid to senior level developer who wants to both learn and contribute to our team.</p>\n\n<p>Do you like what you read and want to be part of it? Please send us your CV along with a covering letter explaining why this job is right for you, and why you are right for the job!</p>","how_to_apply":"<p><a href=\"https://kodify.recruitee.com/o/senior-javascript-developer-remote\">https://kodify.recruitee.com/o/senior-javascript-developer-remote</a></p>","company":"Kodify","company_url":"https://kodify.io/","company_logo":"http://github-jobs.s3.amazonaws.com/f953ccaa-213a-11e8-982a-7b310eab5738.jpg","url":"http://jobs.github.com/positions/58e8dfac-213b-11e8-843b-53b53b103189"},{"id":"32409416-208d-11e8-9bb8-76708c4b53e0","created_at":"Mon Mar 05 15:54:26 UTC 2018","title":"Full Stack Software Engineer (Elixir, Vue.js)","location":"New York","type":"Full Time","description":"<p><strong>The Role</strong>\nThis is an opportunity to join a small, growing team and make a substantial impact at Bowery. We’re looking for someone that can learn, adapt and roll with a fast-paced, ever-changing environment and who isn’t afraid of uncertainty. </p>\n\n<p>Software Engineering at Bowery involves developing software systems that power a modern farm. This includes building out work management, data collection, visualization, and farm automation systems. You’ll be part of idea generation, design, prototyping, planning, and the execution of new software components of all aspects of our farms.</p>\n\n<p>The software stack at Bowery consists of a few, focused Elixir services running in AWS, Phoenix + Vue.js on the front-end, and Elixir (Nerves) running on thousands of in-house built devices on-premise in our farms. We're utilizing an event-driven architecture, RPC, and Channels/WebSockets to pass data throughout our services and real-time UI's.</p>\n\n<p><strong>What you’ll do at Bowery</strong></p>\n\n<ul>\n<li>Create innovative automation solutions and advance the state of indoor farming alongside mechanical engineers, agricultural scientists, and the farm operations team.</li>\n<li>Build responsive, mobile-first web applications to support the demands of farm operations and agricultural science teams.</li>\n<li>Develop systems to collect, process, and visualize data related to plant health and growing environment characteristics.</li>\n<li>Optimize crop cycles and workflow schedules to improve yields and make the best use of time in the farm.</li>\n<li>Scale systems to handle more farms, more sensors, more crops, and more operators.</li>\n</ul><p><strong>Who you are</strong></p>\n\n<ul>\n<li>You’ve got a BS in Computer Science or are just passionate about crafting better software.</li>\n<li>You proactively mitigate issues through test-driven development, continuous deployment, and thoughtful application of monitoring and alerting.</li>\n<li>You’ve developed and scaled production web applications using Elixir/Phoenix, Rails, Django, or similar backend MVC frameworks.</li>\n<li>You’ve built user interfaces using JavaScript frameworks like Vue.js, React, or Angular.</li>\n<li>You’ve used implementations of protocols like MQTT, XMPP, and AMQP to handle messaging between services in a distributed system.</li>\n<li>You’re excited about how advancements in machine learning and IoT can work in harmony to improve the state of the planet.</li>\n<li>You believe that teams succeed and fail together and take responsibility for ensuring the success and safety of your teammates.</li>\n<li>You’re confident taking ownership of projects from start to finish and enjoy the process of turning nebulous ideas into reality.</li>\n</ul><p><strong>About Bowery</strong>\nBowery is growing food for a better future by revolutionizing agriculture. Our modern farming company combines the benefits of the best local farms with advances made possible by technology to grow post-organic produce you can feel good about eating. BoweryOS, our proprietary software system, uses vision systems, automation technology, and machine learning to monitor plants and all the variables that drive their growth 24/7. Because we control the entire process from seed to store, Bowery farms use zero pesticides, 95% less water, and are 100+ times more productive on the same footprint of land than traditional agriculture. Bowery produce is currently available at select Whole Foods and Foragers stores in the Tristate area, and featured on the menus of Tom Colicchio’s New York restaurants Craft and Temple Court. Based in New York City, the company has raised $27.5M from leading investors including General Catalyst, GGV Capital, GV (formerly Google Ventures) and First Round Capital.</p>\n\n<p><strong>We are an equal opportunity employer. We welcome people of different backgrounds, experiences, abilities and perspectives. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability or protected veteran status.</strong></p>","how_to_apply":"<p><a href=\"https://hire.withgoogle.com/public/jobs/boweryfarmingcom/view/P_AAAAAADAAADIT_40mPTc_E\">https://hire.withgoogle.com/public/jobs/boweryfarmingcom/view/P_AAAAAADAAADIT_40mPTc_E</a></p>","company":"Bowery Farming","company_url":"https://boweryfarming.com/","company_logo":"http://github-jobs.s3.amazonaws.com/29bbbfdc-208d-11e8-816b-a758e9890938.jpg","url":"http://jobs.github.com/positions/32409416-208d-11e8-9bb8-76708c4b53e0"},{"id":"a70f5eb8-083b-11e8-80e2-6aeb265cb22e","created_at":"Mon Mar 05 09:17:06 UTC 2018","title":"Experienced Software Engineers","location":"Remote within EU","type":"Full Time","description":"<p>Loco2's mission is to make booking trains anywhere in Europe as easy and affordable as possible, from epic international adventures to everyday local commutes. Our booking coverage is unrivalled and growing.</p>\n\n<p>We're looking for 2 experienced Ruby engineers to join our existing team of six, where you'll help us maintain and improve our existing infrastructure, integrate new rail operator booking systems and scale effectively for our rapidly expanding user base.</p>\n\n<p>At Loco2 we care deeply about building an inclusive, open and supportive work environment. We behave with respect for people and the planet and are seeking a diverse range of candidates that share these values.</p>\n\n<p><strong>About us</strong></p>\n\n<p>We're a <a href=\"https://loco2.com/team\">small, passionate and cosmopolitan team</a>, with a healthy remote-first culture and an office in London. Our success is built on trust, empathy and shared knowledge, with our users at the centre of what we do. <a href=\"https://uk.trustpilot.com/review/loco2.com\">We're proud to have an average rating of 9.3 out of 10 on Trustpilot</a> after 22,000 reviews.</p>\n\n<p>We’ve been selling tickets since 2012 (read our <a href=\"https://loco2.com/our-story\">full story here</a>), and we’re growing rapidly as the business matures. Our goal is to scale effectively whilst continuing to delight our users.</p>\n\n<p><em>Why join us?</em></p>\n\n<ul>\n<li>We have high codings standards, and follow best practices such as continuous testing and delivery</li>\n<li>We strive to learn and improve together in a supportive environment as the wider tech ecosystem evolves</li>\n<li>Our team enjoys a healthy work-life balance and don’t think caffeine-fuelled all-nighters are a good way to grow a company that’s built to last</li>\n<li>We offer flexible hours and a well-designed remote working culture built on trust. Work around your schedule and when you’re most productive</li>\n<li>Our days are not full of meetings and needless distractions, allowing others to achieve flow is a big part of supporting each other</li>\n<li>Everyone is encouraged to ask questions, think creatively and suggest new working practices. We have a small team so your voice will be heard</li>\n<li>You will be provided with a laptop and are empowered to make changes that improve your working environment</li>\n</ul><p><strong>Technical challenges</strong></p>\n\n<p>Our software stack consists of a pure-Ruby backend library which we use to communicate with train booking APIs, a modern Rails application, a PostgreSQL database, and two native mobile applications (iOS and Android).</p>\n\n<p>We’re integrated with multiple rail operator booking systems (with our current team we usually complete at least 1-2 major integrations each year), and we’re increasingly consuming other types of data too (e.g. timetable data for routing, real-time arrivals/departures etc).</p>\n\n<p>We need to diligently manage technical complexity, as each external system works in a slightly different way, with its own features and quirks. SOAP is (unfortunately) used by many operator APIs, which is why we released our open source library, <a href=\"https://github.com/loco2/lolsoap\">LolSoap</a>.</p>\n\n<p>Some of the most difficult challenges we face relate to routing and making sense of lots of data. Which routes are best to get from A to B? Which booking systems should be queried? How might we cache data without affecting accuracy of results?</p>\n\n<p>We’ve recently released mobile applications for iOS and Android. Further developing our mobile strategy is a key goal for the business.</p>\n\n<p>Because Loco2 is the merchant of record for all transactions we are also responsible for fraud prevention, and handling currency and other finance-related issues.</p>\n\n<p>We frequently release new features that drive rapid organic growth, and so it’s vital that we anticipate and address scaling challenges before they occur.</p>\n\n<p><strong>About you</strong></p>\n\n<p>An ideal candidate:</p>\n\n<ul>\n<li>Has 4+ years of professional programming experience</li>\n<li>Has deep knowledge and experience of Ruby</li>\n<li>Is fluent in English and confident communicating and sharing complex information and learnings with both technical and non-technical team members</li>\n<li>Has a good working knowledge of modern devops technologies such as Docker</li>\n<li>Is comfortable designing object oriented software from scratch, not just implementing CRUD Rails apps; a pragmatist who can see the trade-offs involved in the different approaches to solving a problem</li>\n<li>Strives to discover and understand the root cause of problems, suggesting new and improved solutions, rather than treating the symptoms</li>\n<li>Actively considers future maintainability when deciding how to implement something</li>\n<li>Has a keen appetite for self-improvement and growth, but doesn't hesitate to ask for help when needed</li>\n<li>Enjoys getting their teeth stuck into complicated problems, as well as being willing to pitch in on some of the more routine tasks which inevitably arise</li>\n<li>Is willing to participate in an on-call rota to cover technical emergencies out of hours</li>\n<li>Can work hours that have some overlap with London daytime</li>\n<li>Is motivated by Loco2's mission</li>\n</ul>","how_to_apply":"<p>Email <a href=\"mailto:jobs@loco2.com\">jobs@loco2.com</a> and tell us about your skills and experience, plus include links to any relevant public repositories. You can send a CV if you want, but we particularly like reading a well-written email instead/as well.</p>\n\n<p><strong>Unfortunately we can currently only accept applications from within the EU (including the UK).</strong></p>\n\n<p>There are some specific questions we'd like you to answer (feel free to be brief if you’d prefer to elaborate in other areas):</p>\n\n<ol>\n<li>What are some of the most challenging/interesting programming tasks you have worked on?</li>\n<li>Why do you want to work for Loco2?</li>\n<li>What country and timezone do you live in?</li>\n<li>What are your approximate salary expectations? (please state currency)</li>\n</ol><p>We welcome applications from everybody, regardless of race, gender, or sexual orientation.</p>\n\n<p>To try to make the hiring process as fair as possible, if we are interested in your application, then you'll be asked to complete a programming challenge which is judged anonymously. We deliberately anonymise responses to this task in order to mitigate any inherent biases in this regard.</p>\n\n<p>Our emphasis is on finding somebody with demonstrable skills rather than somebody who is good at self-marketing. This process helps us focus on that.</p>\n\n<p><em>Please note that we do not respond to approaches from recruitment agencies, and emails will be marked as spam.</em></p>","company":"Loco2","company_url":"https://loco2.com/en/careers/software-engineer","company_logo":"http://github-jobs.s3.amazonaws.com/2297b50e-083b-11e8-8bc8-5cfdf57c4ca1.png","url":"http://jobs.github.com/positions/a70f5eb8-083b-11e8-80e2-6aeb265cb22e"},{"id":"a736ad96-1e71-11e8-9a9e-5fed54a084df","created_at":"Fri Mar 02 23:30:12 UTC 2018","title":"Siri - Open Source Technologies Engineer","location":"Cupertino, CA","type":"Full Time","description":"<p>DESCRIPTION: Changing the world is all in a day's work at Apple. If you love innovation, here's your chance to make a career of it. You'll work hard. But the job comes with more than a few perks.</p>\n\n<p>The Siri Open Source Technologies team is focused on the progression of several open source technologies used within Siri. These technologies are instrumental to the success of the Siri platform. You will be exposed to projects such as HBase, HDFS, Kafka, Spark, and ZooKeeper at a scale that will test the limits and expose flaws only seen at Apple’s scale. You will commit/contribute to these projects and build a continuous integration pipeline to test, validate, maintain, and patch issues in order to commit back upstream. This will allow Siri to continue to live on the bleeding edge of these technologies and further the performance for our customers.</p>\n\n<p>Key Qualifications:  </p>\n\n<ul>\n<li>3+ years experience as a contributor or committer</li>\n<li>Industry experience in similar roles at large scale companies</li>\n<li>Excellent verbal and written communication skills</li>\n<li>Strong understanding of continuous integration and the infrastructure to support it</li>\n<li>Experience in system design/architecture and implementation</li>\n<li>Expert programming skills with committer rights on one or more Apache project(s)</li>\n</ul><p>Description:\nThe Siri Open Source Technologies team is in a unique position to help push how Siri leverages open source. These contributions will also help other teams within Apple who utilize similar technology stacks. The work executed by this team will be used in production supporting millions of customers in real-time. The team will also be strengthening Siri’s data analytics platform for machine learning and ad-hoc analytics by fixing critical problems in projects such as Kafka and HDFS.</p>\n\n<p>A successful candidate will have experience with the Apache Hadoop stack and the development environment necessary to support it.</p>\n\n<ul>\n<li>Create and manage internal repositories for all open source projects used in Siri</li>\n<li>Build out supporting infrastructure to handle continuous integration</li>\n<li>Implement testing frameworks for pre-Siri adoption</li>\n<li>Define workflow for upgrading versions without service interruption</li>\n<li>Develop new tooling for interacting and maintaining open source projects</li>\n<li>Contribute/commit critical fixes to open source projects both external and internal to Apple</li>\n</ul><p>Education:\nB.S. degree in Computer Science and 3+ years of programming experience or equivalent.</p>\n\n<p>Additional Requirements:\n(Nice to have items)</p>\n\n<p>Knowledge of core Linux fundamentals\nScripting skills (Python, Bash, Ruby, etc.)\nExperience with compute containerization (i.e. - Mesos, Docker, schedulers)</p>\n\n<p>Apple is an Equal Employment Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities.</p>\n\n<p>REQUISITION NUMBER: 113424290\nCOMPANY NAME: Apple Inc.</p>","how_to_apply":"<p><a href=\"https://ars2.equest.com/?response_id=9da2d5571de99e38539d46ad3b9e27c6\">APPLY URL</a></p>","company":"Apple Inc.","company_url":"http://www.apple.com","company_logo":"http://github-jobs.s3.amazonaws.com/7e52779e-1e70-11e8-9f28-0ebd59c82620.jpeg","url":"http://jobs.github.com/positions/a736ad96-1e71-11e8-9a9e-5fed54a084df"},{"id":"91972990-1e51-11e8-9e92-8568e583cd55","created_at":"Fri Mar 02 19:40:53 UTC 2018","title":"Senior Full Stack Software Engineer ","location":"Remote ","type":"Full Time","description":"<p>CircleCI is looking for an experienced full stack software engineer to help us develop a seamless user experience. You will work closely with Product and Design to ensure developers who interact with CircleCI via the web have a consistent and streamlined experience from the first time they touch the site.</p>\n\n<p>At CircleCI you will be working with a team who values trust, respect, and diversity. We are a globally distributed team working towards the common goal of being the standard bearer for continuous integration and deployment software. We are remote friendly, and are looking for people who are passionate about helping shape software engineeringing best practices for the industry as a whole.</p>\n\n<p>To thrive in this role you are someone who works well in teams, and enjoys collaborating. Furthermore you have experience in onboarding, engaging, and retaining users through their journey on various platforms. You enjoy working with Product and Design to find the best solution to the problem at hand, and balance technical tradeoffs with delivering customer value quickly and iteratively. Experience with Growth Engineering a plus.</p>\n\n<p><b>About CircleCI</b></p>\n\n<ul>Velocity is critical for software teams in today's competitive landscape, but maintaining speed can be difficult as apps and systems grow larger and more complex. CircleCI’s platform allows developers to rapidly release code (for web and mobile apps) they trust by automating the build, test, and deploy process. CircleCI enables developers to detect and fix bugs before they even reach customers. Thousands of leading companies including Facebook, Kickstarter, Shyp and Spotify rely on CircleCI to accelerate delivery of their code and enable developers to focus on creating business value fast.</ul><ul>\n<b>About this role:</b>\n<ul>\n<li>Work closely with Product and Design to brainstorm the best way to onboard, engage, and retain customers through the entirety of their user journey</li>\n<li>Build conversion funnels, and the mechanisms to track their success and opportunities for improvement</li>\n<li>Use data to analyze user paths as a way to inform hypotheses about CircleCI’s platform</li>\n<li>Test these hypotheses with mechanisms such as AB testing</li>\n<li>Work in Clojure on the backend, and JavaScript in React on the frontend, on a daily basis</li>\n</ul>\n<p><b>You Have:</b></p>\n\n<ul>\n<li>3+ years of production development experience</li>\n<li>Experience developing single page applications</li>\n<li>Experience working on server side application code\n</li>\n<li>Experience with and appreciation for the functional programming paradigm</li>\n<li>Articulate UI and UX opinions, especially in regards to platforms and funnel dynamics</li>\n<li>Experience verifying or refuting your hypotheses using data</li>\n<li>A deep appreciation for and abilities to support your development with appropriate testing</li>\n<li>Experience with Growth Engineering</li>\n</ul>\n<p><b>You Enjoy:</b></p>\n\n<ul>\n<li>Working in a highly collaborative environment</li>\n<li>Supporting an environment that values trust, respect, and diversity</li>\n<li>Exploring different methods for efficiently delivering code and customer value</li>\n<li>Delivering value to customers</li>\n<li>Sharing your expertise and encouraging best practices</li>\n<li>Utilizing data to inform your opinions</li>\n</ul>\n<p>CircleCI is a Bay Area Best Places to Work 2016 award winner. Founded in 2011 and headquartered in beautiful downtown San Francisco with a global remote workforce, CircleCI is venture backed by Scale Venture Partners, DFJ, Baseline Ventures and Harrison Metal Capital.</p>\n\n<p>We care deeply about diversity and inclusivity. We’re hiring at all experience levels, and seek talented teammates from a wide variety of backgrounds and experiences who are equally committed to cultivating a work environment of respect and kindness. We carefully consider every applicant that takes the time to apply.</p>\n</ul>","how_to_apply":"<p><a href=\"https://jobs.lever.co/circleci/e7d84f5e-60f7-4c9b-b6a6-5e8ed7926207?lever-origin=applied&amp;lever-source%5B%5D=GITHUB\">https://jobs.lever.co/circleci/e7d84f5e-60f7-4c9b-b6a6-5e8ed7926207?lever-origin=applied&amp;lever-source%5B%5D=GITHUB</a></p>","company":"CircleCI","company_url":"http://www.circleci.com ","company_logo":"http://github-jobs.s3.amazonaws.com/8737cfae-1e51-11e8-84cd-f13f80dc8bfd.jpg","url":"http://jobs.github.com/positions/91972990-1e51-11e8-9e92-8568e583cd55"},{"id":"037fa17c-1e48-11e8-9be6-29a2d796edb1","created_at":"Fri Mar 02 18:32:43 UTC 2018","title":"Backend Web Developer (Node)","location":"Los Angeles, CA","type":"Full Time","description":"<p><strong>Who We Are</strong></p>\n\n<p>ScaleLab is a leading digital talent network on a mission to help online influencers expand their audience and overall career through technology and top-level agency services. We represent thousands of established social media stars and pride ourselves on providing each of them with the tools, support, community and resources they need to grow on and beyond the digital platforms they’ve mastered. Developing cutting-edge technology that utilizes years of industry experience combined with the enormous amounts of data provided by our large client-base is the core of the future of our company. This is where you come in!</p>\n\n<p><strong>Who are we looking for</strong></p>\n\n<p>Are you a type of person who loves to dive into a new technology stack? Are you self-motivated to explore and embrace new trends, routines, and technology? Do you love to work in a small and productive team? </p>\n\n<p>We are looking for an experienced, LA-based Backend Engineer who will play a key role in ScaleLab’s vision for an integrated experience for brands and influencers. You will be a part of a small, highly-collaborative engineering team building a new product that’s meant to revolutionize the influencer marketing industry.  </p>\n\n<p><strong>Requirements</strong></p>\n\n<ul>\n<li>5+ years of back end development (Node)</li>\n<li>Strong critical thinking and problem solving skills, motivation, and passion</li>\n<li>Expert level ES6/7 JavaScript with Koa/Express frameworks</li>\n<li>Practical experience building and consuming RESTful APIs</li>\n<li>Strong knowledge of SOLID (object-oriented design), and Object-relational mapping</li>\n<li>Experience in SOA (Service-oriented architecture)</li>\n<li>Strong MySQL knowledge (table design, complex query creation, best practices)</li>\n<li>Solid understanding of the full web technology stack (e.g. HTTP, cookies, asset loading, caching, REST)</li>\n<li>Solid fundamental understanding of testing (including stubbing, functional, unit, and e2e)</li>\n<li>Experience using CI/CD tools and systems such as Jenkins, Hudson, GitLab, GitHub, etc.</li>\n<li>Experience with Websockets is a plus</li>\n</ul><p><strong>Responsibilities</strong></p>\n\n<ul>\n<li>Design, develop, and maintain various backend APIs using Node and Koa</li>\n<li>Write and maintain clean, well-written, test-driven JavaScript code and documentation conforming to standards</li>\n<li>Troubleshoot, identify and resolve API performance problems</li>\n<li>Optimize database schema, queries, and caching</li>\n<li>Collaborate with peers on best practices and promote knowledge sharing</li>\n<li>Release early, release often</li>\n</ul>","how_to_apply":"<p>Please apply <a href=\"https://scalelab.com/en/careers/backend-web-developer-node\">here</a></p>","company":"ScaleLab","company_url":"http://scalelab.com","company_logo":"http://github-jobs.s3.amazonaws.com/a4b23ba6-1e46-11e8-8c7d-44b5abe23baa.png","url":"http://jobs.github.com/positions/037fa17c-1e48-11e8-9be6-29a2d796edb1"},{"id":"cb5e5ca2-1e29-11e8-8d08-9126586c0f5c","created_at":"Fri Mar 02 14:57:09 UTC 2018","title":"Software Engineer ","location":"Paris - France ","type":"Full Time","description":"<p>1000mercis helps customers collect, analyze and leverage their data across all marketing channels.\nTo do this, we are more than 100 engineers (a quarter of 1000mercis) divided into teams with a human dimension. We accompany each person to develop a positive influence and be autonomous.\nOur sustained growth pushes us to constantly challenge our technical and organizational choices.</p>\n\n<p><strong>Responsibilities</strong></p>\n\n<p>Due to our wide range of interconnected products, our technical issues are very varied and often complex.\nOur daily missions are to process thousands of queries distributed around the world per second, operate multiple petabytes databases (Big Data™), automate our entire bare-metal infrastructure, and build tomorrow's digital marketing interfaces.</p>\n\n<p><strong>Profile</strong></p>\n\n<ul>\n<li>Strong IT culture and technical curiosity</li>\n<li>Thorough knowledge in at least one back-end and/or front-end stack</li>\n<li>Interest in databases, the world of open-source, and/or DevOps culture</li>\n<li>Good communicator, able to popularize work, defend ideas and listen to others</li>\n<li>Willingness to progress and to help others progress, technically (meetups, internal training) and humanly</li>\n<li>Good experience using Python and/or Javascript is a plus</li>\n<li>Daily use of Linux is very preferable but not required</li>\n<li>Professional English (our teams are international)</li>\n</ul><p><strong>About 1000mercis group</strong></p>\n\n<p>The story began in a kitchen in the year 2000, then it's the IPO followed by acquisitions, a double-digit growth and here we are!\nWe are pioneers of Data Marketing, recognised experts in digital CRM and Programmatic Marketing. We handle everything from data collection to activation on all digital platforms (mobile, desktop, tablets and connected objects).</p>\n\n<p>As of today, we are a strong team of 400 employees. Based in San Francisco, New York, London, Dubai, Amsterdam, Tel Aviv. Our R&amp;D focused teams are based in Paris.</p>\n\n<p>Alongside Alternext (ALMIL.PA), 1000mercis devotes more than 10% of its turnover to R&amp;D, particularly in the field of machine learning, and has won the \"Innovative Company\" qualification of BPI France.\nJoin our success story.\nMore information on <a href=\"http://www.1000mercis.com\">www.1000mercis.com</a>.</p>","how_to_apply":"<p>Email your resume to <a href=\"mailto:marguerite@1000mercis.com\">marguerite@1000mercis.com</a></p>","company":"1000mercis group","company_url":"https://www.1000mercis.com","company_logo":"http://github-jobs.s3.amazonaws.com/ff09e7fc-1e28-11e8-9c0e-f85f5f0f76d3.png","url":"http://jobs.github.com/positions/cb5e5ca2-1e29-11e8-8d08-9126586c0f5c"}]